[{
        "description_text": "<div> <p>Job Description</p> < p > Android Developer: < /p> < ul > < li > Sound knowledge of Android, Java, Kotlin and XML parsing < /li> < li > Should have developed and published at least 2 apps < /li> < li > Proficient with Android SDK < /li> < li > Knowledge of working on remote data via REST & amp;JSON < /li> < li > Knowledge of custom layouts and third - party libraries & amp;APIs < /li> < li > Knowledge of payment gateway integration is an added advantage < /li> < li > Knowledge of MVVM architecture < /li> < / ul > < /div> </div>",
        "requirement_text": "<ul> <li>Build advanced applications for Android platform</li> < li > Implement Mobile Shopping, Payment & amp;Security features < /li> < li > Integrate web services like SOAP, POST & amp;REST with mobile app < /li> < li > Collaborate with cross functional teams to complete complex tasks < /li> < li > Work with outside data sources & amp;APIs < /li> </ul>",
        "job_title": "Android Developer"
    },
    {
        "description_text": "<div> <p>Fox News is seeking an Android Developer to assist with maintaining the Fox News and Fox Business mobile and OTT apps. We're looking for someone who is proficient at coding in Java and Kotlin and adheres to best practices to ensure delivery of stable and reliable app releases. You will have the opportunity to solve challenging technical problems and maintain good communication with other developers and stakeholders. In addition to programming, you will assist with maintaining CI/CD workflows, improving testing solutions, and optimizing the overall development process. < / p >< p >< /p >< p >< b > A SNAPSHOT OF YOUR RESPONSIBILITIES < / b >< /p >< ul >< li >< p > Develop features for the Fox News and Fox Business mobile and OTT apps < /p> </li >< li >< p > Document code in a clear and concise manner < /p> </li >< li >< p > Identify and address technical debt < /p>undefined</li >< li >< p > Monitor and improve app performance < /p>undefined</li >< li >< p > Review and approve code changes from other developers < /p>undefined</li >< li >< p > Collaborate with cross - functional teams to define and ship new features < /p>undefined</li >< /ul>undefined</div >",
        "requirement_text": "<div> <ul> <li> <p>3+ years of experience in Android Development using Java < / p >< /li >< li >< p > 2 + years of experience in Android Development using Kotlin < / p >< /li >< li >< p > Experience with RESTful JSON feed consumption < / p >< /li >< li >< p > Experience with push notification integration and deep linking < / p >< /li >< li >< p > Experience with Git, GitHub and Gitflow < /p> </li >< li >< p > Experience with the latest development paradigms regarding performance, security, and coding best practices < /p> </li >< li >< p > Strong knowledge of design patterns < /p> </li >< li >< p > Good communication skills with different stakeholders such as QA, Project Managers, and Product Owners < /p> </li >< /ul> <p></p >< ul >< li >< p > BS or higher in Computer Science or related field < /p>undefined</li >< li >< p > Experience with OTT(Android TV / Fire TV) development < /p>undefined</li >< li >< p > Experience with Google IMA SDK < /p>undefined</li >< /ul>undefined</div > ",
        "job_title": "Android Developer"
    },
    {
        "description_text": "<ul> < li > 5 + years of experience hands - on professional Android development experience < /li> < li > Extensive experience with Java and full command of Android APIs on all OS versions < /li> < li > Experience working a significant consumer app that is currently available in the marketplace < /li> < li > Experience with web - related technologies, including JavaScript, HTML 4 / 5, AJAX, JSON, XML, Kotlin < /li> < li > Solid understanding of data models and data access architecture and optimization < /li> < li > Strong understanding of multi - tier web architectures, and OO design patterns and concepts < /li> < li > Strong understanding of server - side software, scalability, performance, and reliability < /li> < li > A sound understanding of HTTP and REST - style web services < /li> < li > Must demonstrate solid organization / communication skills < /li> < li > Coordinate with the Technical Architects and Leads on current programming tasks. < /li> < li > Collaborate with other programmers to design and implement features. < /li> < li > Quickly produce well - organized, optimized, and documented source code. < /li> < li > Create and document software tools required by artists or other developers. < /li> < li > Debug existing source code and polish feature sets. < /li> < li > Contribute to technical design documentation. < /li> < li > Translate designs and wireframes into high - quality code < /li> < li > Design, build and maintain high performance, reusable, and reliable Java code < /li> < li > Ensure the best possible performance, quality, and responsiveness of the application Identify and correct bottlenecks and fix bugs < /li> < li > Help maintain code quality, organization, and automatization < /li> < / ul > </ul> ",
        "requirement_text": "<ul> < li > 5 + years of experience hands - on professional Android development experience < /li> < li > Extensive experience with Java and full command of Android APIs on all OS versions < /li> < li > Experience working a significant consumer app that is currently available in the marketplace < /li> < li > Experience with web - related technologies, including JavaScript, HTML 4 / 5, AJAX, JSON, XML, Kotlin < /li> < li > Solid understanding of data models and data access architecture and optimization < /li> < li > Strong understanding of multi - tier web architectures, and OO design patterns and concepts < /li> < li > Strong understanding of server - side software, scalability, performance, and reliability < /li> < li > A sound understanding of HTTP and REST - style web services < /li> < li > Must demonstrate solid organization / communication skills < /li> < li > Coordinate with the Technical Architects and Leads on current programming tasks. < /li> < li > Collaborate with other programmers to design and implement features. < /li> < li > Quickly produce well - organized, optimized, and documented source code. < /li> < li > Create and document software tools required by artists or other developers. < /li> < li > Debug existing source code and polish feature sets. < /li> < li > Contribute to technical design documentation. < /li> < li > Translate designs and wireframes into high - quality code < /li> < li > Design, build and maintain high performance, reusable, and reliable Java code < /li> < li > Ensure the best possible performance, quality, and responsiveness of the application Identify and correct bottlenecks and fix bugs < /li> < li > Help maintain code quality, organization, and automatization < /li> < / ul > </ul> ",
        "job_title": "Android Developer | Pennsylvania"
    },
    {
        "description_text": "<p>Looking to join a fast-growing, cutting edge technology company serving customers nationwide? Look no further! TownNews.com, the premier internet hosting provider for media companies in the broadcast and newspaper industry, seeks a seasoned mobile developer to join our team. You will work closely with a small team developing mobile applications for over a hundred customers.</p>",
        "requirement_text": "<div> <ul> <li> Experience developing native iOS applications written in Swift using the latest versions of the Xcode < /li> <li> Experience developing native Android applications written in Java using the latest versions of the Android Studio < /li> <li> Experience working with Git source code management and development collaboration tools for issue tracking and requirements documentation < /li> <li> Knowledge of Android SDK(Jetpack, Webkit, Gradle, ConstraintLayout), different versions of Android, and how to deal with different screen sizes < /li> <li> Knowledge of iOS SDK(UIKit, WebKit, AVFoundation, AutoLayout), and how to deal with different screen sizes < /li> <li> Knowledge of RESTful APIs to connect mobile applications to back - end services < /li> <li> Familiarity with push notifications < /li> <li> Familiarity with Deep Linking / App Linking < /li> <li> Familiarity of Google Mobile Ads < /li> </ul >< ul >< li > 3 years of professional work experience specialized in mobile development < /li> <li> Design, build, and maintain high performance, reusable, and reliable Swift / Java code < /li> <li> Help maintain code quality, organization, and automation < /li> <li> Work with product managers and other stake holders to provide technical requirements < /li> <li> Troubleshoot and fix software defects using an issue tracking system < /li> <li> Perform code reviews with other developers < /li> </ul >< /div>",
        "job_title": "Mobile Developer (iOS/Android)"
    },
    {
        "description_text": "<div> <p>We’re a team of more than 50 designers, developers, marketing strategists, engagement managers, and testers. From creating impactful software for the largest companies in the world to competing in our annual chili cook-off - we love our team and the work we do together.</p> <p> <b> Key Responsibilities < /b> </p >< ul >< li > A technical leader, an early adopter of technology < /li> <li> Critical thinker, ready to debate the merits of technology approaches, application designs, and business plans < /li> <li> Self - starter, with a strong sense of ownership on internal and client startups < /li> <li> Excellent analytical and problem - solving skills with a focus on the details < /li> <li> Passionate about creating innovative products for enterprise clients < /li> </ul >< /div>",
        "requirement_text": "<ul> <li> 5 - 10 years of mobile development experience using one or more of the following: Kotlin, Swift and Xamarin < /li> <li> Proficient with both Native Android & amp;iOS < /li> <li> Experienced in integrating with APIs, persisting data, caching and refreshing < /li> <li> Ability to accurately estimate work < /li> <li> Experience with agile development and software engineering best practices < /li> <li> Have successfully published several applications to Apple and Google Play store < /li> <li> Experience consuming RESTful services < /li> <li> Experience with unit testing < /li> <li> Strong communication skills, both written and verbal < /li> </ul > ",
        "job_title": "Mobile (iOS/Android) Developer"
    },
    {
        "description_text": "<div> <p>We’re looking for a talented mobile app developer to help us build the next generation of messaging at eBay, impacting millions of people and billions of messages each year.</p> <p></p> <p> eBay is a global commerce leader where you can influence how the world buys, sells, and gives.You’ ll be part of a work culture that’ s been genuinely committed to diversity and inclusion since its founding twenty five years ago.Here, you can be yourself, do your best work, and have a meaningful impact on people across the globe.We seek people with drive, ideas, and a passion for helping small businesses succeed to help shape the future of eBay— does this sound like you ? If so, we’ d love to talk to you! < /p>< / div > ",
        "requirement_text": "<ul> <li> <p> 5 + years of experience in designing, building, refactoring and releasing large scale native apps in a distributed global environment. < /p> </li >< li >< p > Experience in Agile / Scrum methodologies and working in Agile teams is desirable < /p> </li >< li >< p > Able to own a feature of an iOS application and develop it fully. < /p> </li >< li >< p > Proven experience with Java / Kotlin on Android or Objective - C / Swift on iOS. < /p>undefined</li >< li >< p > Experience with TDD, pair programming, code reviews, and other techniques to maintain high - quality code and resiliency. < /p>undefined</li >< li >< p > Experience working on complex systems and navigating ambiguity in requirements. < /p>undefined</li >< /ul>",
        "job_title": "Senior Mobile Developer (iOS, Android)"
    },
    {
        "description_text": "<div> <p>The U-Haul Mobile team is looking for an Android developer responsible for the development and maintenance of both enterprise and customer-facing applications. Our company has multiple lines of business within the moving marketplace including truck rentals, car sharing, Moving Help, and retail items to name a few. Our challenge? Develop mobile applications that make our customer's experience with our services as remarkable as possible and support our internal business needs. Do you have the development capabilities to succeed at this task? <br>< / p >< p >< /p >< p >< b > Responsibilities < / b >< /p >< p > •Participate in the full mobile application development lifecycle. < / p >< p > •Develop, test, and deploy user interface, service tier, and data tier components for complex mobile applications. < /p> <p>• Code, debug, test, and maintain applications to meet requirements. < / p >< p > •Ensure the best possible performance, quality, and responsiveness of the application. < /p> <p>• Maintain, support, troubleshoot, monitor and optimize mobile applications. < / p >< p > •Work with other U - Haul IT teams to design and implement quality software solutions. < /p> <p>• Conduct peer reviews of team members ’ code. <br>< / p >< /div > ",
        "requirement_text": "<div> <p> <b>Skills < / b >< /p >< p > •At least 3 + years of Android development experience and knowledge of the following: < / p >< p > •High proficiency in Java or Kotlin. < / p >< p > •Experience and understanding of the entire Mobile SDLC using Android SDK. < /p> <p>• Experience writing Native Android applications. < / p >< p > •Good working knowledge of networks and security thereof. < /p> <p>• S trong knowledge of: activities, fragments, collections, multithreading, networking, profiling, performance tuning, and offline storage. < / p >< p > •Debugging and problem - solving skills. < /p> <p>• Solid experience with OOP and design patterns, such as MVVM, MVC, Strategy, etc. < / p >< p > •Knowledge of Android networking and REST / JSON / XML Web Services and integration with 3 rd party libraries and APIs. < /p> <p>• Knowledge of the open-source Android ecosystem and the libraries available for common tasks. < / p >< p > •Ability to work in a Git - based Continuous Integration(CI) environment. < br >< /p> <p></p >< p > You will be successful in this role if you: < /p> <p>• Complete daily development assignments that include internal and external mobile applications. < / p >< p > •Analyze and implement solutions to presented problems while satisfying the user 's needs. < / p >< p > •Write code that is easily maintainable and highly reliable. < /p> <p>• Possess the ability to multitask and prioritize work as necessary. < / p >< p > •Collaborate with a team to successfully complete projects on time. < br >< /p> </div > ",
        "job_title": "Android Developer"
    },
    {
        "description_text": "<div> <p>We’re looking for a motivated mobile app developer to help us build the next generation of messaging at eBay. Together, we will impact millions of people and billions of messages each year.</p> <p></p> <p> eBay is a global commerce leader where you can influence how the world buys, sells, and gives.You’ ll be part of a work culture that’ s been genuinely committed to diversity and inclusion since its founding twenty five years ago.Here, you can be yourself, do your best work, and have a meaningful impact on people across the globe.We seek people with drive, ideas, and a passion for helping small businesses succeed to help shape the future of eBay— does this sound like you ? If so, we’ d love to talk to you! < /p> < / div > </p> </div> ",
        "requirement_text": "<ul><li><p> 2 + years of experience in designing, building, refactoring and releasing native apps. < /p></li > < li > < p > Experience in Agile / Scrum methodologies and working in Agile teams is desirable < /p></li > < li > < p > Able to own a feature of an iOS application and develop it fully. < /p></li > < li > < p > Proven experience with Java / Kotlin on Android or Objective - C / Swift on iOS. < /p></li > < li > < p > Experience with TDD, pairing, code reviews, and other techniques to maintain high - quality code and resiliency. < /p></li > < /ul>",
        "job_title": "Mobile App Developer (iOS, Android)"
    },
    {
        "description_text": "<div><p>Our mission is to defend human rights and democracy through building software that is essential for <b>digital freedom </b>and <b>privacy protection</b> for all Internet users.</p> < p > ProtonMail was founded in 2014 by a group of scientists who met at the European Organization for Nuclear Research(CERN).And since its inception, the company has grown at a fast pace and today has over 26 million users.Our principal product, < b > ProtonMail < /b>, is the world’s largest secure email service. Our second product, <b>ProtonVPN</b > , is one of the world’ s most popular VPN services.Our vision is to build an Internet platform for the protection of digital rights, and we are also developing additional products such as < b > ProtonCalendar, < /b> <b>ProtonDrive</b > , and much more. < /p><p>Proton users include leaders of the Hong Kong protest movement, <i>New York Times</i > journalists, some of the world’ s largest corporations, and millions of ordinary citizens from over 180 countries.Our team is diverse and dynamic, representing over 30 different nationalities, with offices in Geneva, Zurich, Prague, Vilnius, Skopje, San Francisco, and Taipei. < /p><br> < p > < /p><p><b> What You will do: < /b></p > < p > You will contribute to the development effort for existing and future ProtonMail and ProtonVPN for Android devices.This includes interacting with our existing backend REST APIs, providing feedback based on mobile needs, and working with our web, backend, and server teams to build new features.You will also coordinate with our QA / Support team to analyze our Android apps and assist with debugging them. < br > < /p> < / div >",
        "requirement_text": "<ul> <li>8+ years of experience in software development (with a strong command of OOP, data structures and algorithms) of which at least 5 years of extensive Android development</li> < li > Fluent with Java and Kotlin and Coroutines < /li> < li > Excellent knowledge of multithreading < /li> < li > Knowledge of latest trends and libraries in Android ecosystem < /li> < li > Working knowledge of RESTful web APIs and complex systems < /li> < li > Knowledge of Git or other source control < /li> < li > Experience with automated testing, Continuous Integration and Development < /li> </ul> ",
        "job_title": "Senior Android Developer"
    },
    {
        "description_text": "<div><p>At <b>sync.</b> money we are looking for a ‘super-hero’ <b>Android Developer</b> An incredible new team player to join our family and help us to make a real difference. Someone to bring positive energy and a smile to the workplace. Whilst we may be building a company and a brand, we’re also building bonds that can last a lifetime.</p></div>",
        "requirement_text": "<ul> <li> English speaking, with multiple languages beneficial. < /li> </li> <li> Hardworking, willing to take responsibility but also a co - worker. < /li> </li> <li> Proactive, willing toget involved with the wider team and helping where possible. < /li> </li> <li> Being passionate about your job and taking the initiative on coming up with new ideas how we can improve our product, culture and company.You are part of the community but a user too! < /li> </li> <li> Willing to learn but also to coach others where possible. < /li> </li> <li> Understanding about the importance of our product, the customer experience to peoples everyday lives and the need to support them where appropriate. < /li> </li> </ul> ",
        "job_title": "Android Mobile Developer"
    },
    {
        "description_text": "<div><div> < div > Hive is a full stack deep learning platform helping to bring companies into the AI era. < /div><div></div > < br > < div > Two Stanford graduate students determined to build practical applications using novel deep learning technologies founded < b > Hive < /b>(https:/ / thehive.ai / ).From the beginning, we knew that high - quality datasets were critical to creating deep learning models.However, we also knew that the quantity of labeled data also has a huge impact on model performance.With this in mind, we first started by building a data - labelling platform specifically designed to solve machine - learning problems.This platform, < b > Hive Data < /b>, is now the world’s largest distributed human workforce for data labelling and produces millions of high-quality annotations every day. Hive Data allows us to label uncommonly large datasets at a fraction of the cost that other data labelling solutions would charge. Once Hive Data was built, we were able to quickly label enormous datasets and rapidly build a suite of machine learning models that now form our core offerings in Hive Predict.</div > < div > Our < b > Hive Predict < /b>team has since built a wide range of custom machine learning models spanning a range of verticals including media, retail, security, and autonomous driving. Drawing on this experience and expertise, we then set out to build a stand-alone analytics platform for TV advertising called <b>Hive Media</b > .Hive Media synthesises our company 's fundamental technologies and leverages industry partnerships to deliver a truly revolutionary product. Hive offers the only true, full- stack deep learning platform in the world, assisting clients with data labelling, model building, and the development of full enterprise solutions.</div><div> Today, we work with some of the largest companies in the world to redefine how they think about unstructured visual data and together we build solutions that completely transform verticals.We are fortunate to be funded by leading investors like Peter Thiel(Founders Fund), General Catalyst, Formation 8, and others.We have over 160 talented individuals globally, based in our San Francisco and Gurugram offices. < /div><div></div > < br > < div > In order to execute our vision, we need to grow our team of best - in -class engineers.We are looking for talented < b > Android developers < /b>who will thrive in an autonomous engineering-driven environment. You will take ownership of a product and have the ability to shape product direction.</div > < /div><div><div> < div > < ul > < li > Design and develop a delightful Android application for our users, with a focus on simplicity of use and high - performance < /li><li> Write product - independent code and design modular APIs to be used across all of our products < /li><li> Work across disciplines with team members from front - end, backend, design, and product < /li><li> Help ensure we’ re bug - free by writing unit - tests, and regularly communicating with our QA team < /li><li> Actively participate in product decisions, ensuring we set reasonable development deadlines < /li></ul > < /div></div > < /div> < / div >",
        "requirement_text": "<div> <ul> <li>You attended a top university, studying computer science or similar</li> <li> You understand the ins and outs of RESTful web services < /li> </li> <li> You have great communication skills and ability to work with others < /li> </li> <li> Strong development skills with Java and the Android SDK < /li> </li> <li> You have an understanding of MVP and / or MVVM < /li> </li> <li> You have experience developing, releasing, and maintaining Android applications on top of RESTful APIs < /li> </li> <li> You have fundamentals in OO - design, data structures, and problem solving < /li> </li> <li> You have experience shipping quickly and often, while still maintaining test coverage < /li> </li> <li> You are a team player - no job is too small or too big! < /li> <div></div> < br > < div > If you have experience developing location - aware mobile applications, that is a plus! < br > < /div> </li> </ul> < /div> </div>",
        "job_title": "Android Developer"
    }, {
        "description_text": "<div>WeWe are currently looking for Mobile application developers ( 3+ Years) who should have in-depth knowledge of native Android SDK.<br> < / div > ",
        "requirement_text": "<ul> <li>3+ years experience with good knowledge of Native Android SDK development in Java or Kotlin.</li> <li> Good expertise in working with web services, local storage, location services etc. < /li> </li> <li> Good knowledge in architectural patterns like MVVM.MVC, MVI etc. < /li> </li> <li> Experience implementing push notifications. < /li> </li> <li> Knowledge of common libraries like Retrofit, Android architecture components, RxJava / RxKotlin etc. < /li> </li> <li> Good knowledge of all app store management activities including firebase console. < /li> </li> <li> Should be someone who keeps in touch with the latest trends going on with mobile development. < /li> </li> <li> Good communication and ability to liaise with customers directly to execute projects end to end. < /li> </li> </ul> ",
        "job_title": "Android Developer"
    }, {
        "description_text": "<div><p>National Information Solutions Cooperative (NISC) is an information technology company that develops and supports software and hardware solutions for our Member/Owners who are primarily utility and telecommunications cooperatives and companies across the nation. NISC is an industry leader providing advanced, integrated IT solutions for consumer and subscriber billing, accounting, engineering and operations, as well as many other leading-edge IT solutions. NISC is ranked in ComputerWorld's Best Places to Work survey for fifteen consecutive years.</p> < p > < b > Primary Responsibilities: < /b></p > < p > NISC is looking for passionate Android Mobile Developers to add to our team and push our native applications to their fullest potential.This application developer will work with our talented software engineers to design, build and evolve our mobile application suite.This position will work closely with our product, quality assurance and support staff to ensure quality and functionality requirements are met. < /p> < p > < b > Essential Functions: < /b></p > < ul > < li > Design and build native applications for the Android platform < /li> < li > Collaborate with cross - functional teams to research, design and implement new features. < /li> < li > Research, analyze, and resolve moderately complex customer issues and bugs. < /li> < li > Unit test and integration test code as needed. < /li> < li > Follow all established software development methodologies and procedures. < /li> < / ul > < /div>",
        "requirement_text": "<ul> < li > 2 + years industry experience < /li> < li > Extensive Java Experience < /li> < li > Strong understanding of Android development environment, tools and best practices < /li> < li > Strong understanding of Computer Science concepts < /li> < li > Ability to work within a team with mixed levels of engineers < /li> < li > Strong design skills and understanding of OO concepts < /li> < li > Strong knowledge / understanding of multithreading < /li> < li > Experience in leadership or mentoring roles a plus < /li> < li > BS / MS in Computer Science, Computer Engineering or related. < /li> < / ul > </ul>",
        "job_title": "Android Mobile Developer"
    }, {
        "description_text": "<div> <b>Senior Android Developer - Remote</b><br /> < br > < b > Role: < /b>Direct Hire<br /> < br > < b > Pay: < /b>up to $160k (DOE)<br /> < br > Our client is a software start - up in Cambridge which specializes in building innovative solutions for their native cloud and mobile platform(similar to Peloton). < br > < br > They are looking for a < b > Senior Android Developer < /b> to help build out their Kotlin based cloud-native (AWS) microservices architecture.<br /> < br > < /div> </div>",
        "requirement_text": "<ul> <li>Experience using Kotlin for RESTful API development</li> < li > Experience with SQL and relational databases like SQLite < /li> < li > Experience leveraging AWS cloud services like S3, RDS, EC2, etc. < /li> < / ul > </ul> ",
        "job_title": "Senior Android Developer - REMOTE"
    }, {
        "description_text": "<div><p><b><i>We are providing visa sponsorship for OPT and H1 candidates in coming April.</i></b></p><p><b> Opportunity Overview: < /b></p > < p > WINTrio is a leading provider of cloud managed services, agile software development, DevOps, systems engineering, IT service management and risk analytics.We work collaboratively with our federal and commercial customers to solve their biggest challenges through a commitment to delivering innovation, agility, and maximum value.Our team members are empowered to think outside of the box and provide innovative solutions to our customers and provide measurable cost saving. < /p><p> It is a 5 - year project with a large client in completely DevOps / DevSecOps arena with the < b > latest and greatest tools < /b> and technologies for folks to broaden their skills set. The <b>stability, growth, and flexibility</b > are the key benefits provided with this opportunity.The project is the backbone for our client providing all cloud and DevOps / DevSecOps type services with the latest and greatest tools… not a routine job or a contract.It is probably < b > one of the few organizations like Amazon, Netflix, and Google implementing a true DevOps / DevSecOps culture < /b> and transforming the way business is done.</p > < /div>",
        "requirement_text": "<ul> <li>Hands - on mobile design and development experience on < b > Android platform with Kotlin < /b> for at least 3 years; <b>deep Kotlin knowledge and understanding is a must</b> < /li></li> <li> Preferably, someone with Swift knowledge < /li> </li> <li> Good experience with User Interface and User Experience technologies < /li> </li> <li> To use and work with outside APIs and data sources < /li> </li> <li> To perform unit test to ensure usability, robustness, edge cases and general reliability < /li> </li> <li> To work and make sure improved application performance and bug fixing < /li> </li> <li> Cross - functional team collaboration to design, define and ship new features < /li> </li> </ul> ",
        "job_title": "Android and Mobile Developer"
    }
]