[
  {
    "description_text": "<p>At BlackRock, we are looking for Software Engineers who like to innovate and solve complex problems. We recognize that strength comes from diversity, and we will embrace your unique skills, curiosity, drive, and passion while giving you the opportunity to grow technically and as an individual.</p>\n<p>\nBeing a developer at BlackRock means you get the best of both worlds: working for one of the most advanced financial companies and being part of a software development team responsible for next generation technology and solutions.</p>",
    "requirement_text": "<ul>\n<li><p>Passionate about improving user experience, and wants to understand first-hand how our product is used every day, where it meets our users’ needs and where it does not</p>\n</li>\n<li><p>Love coding and to tackle problems big and small, and will stop at nothing to get the job done!</p>\n</li>\n<li><p>Curious and enjoy learning new things to deliver an impactful solution for our users</p>\n</li>\n<li><p>Loves working on a team, and has strong communication skills</p>\n</li>\n<li><p>Excited to learn about both the business and technology sides of a fin-tech organization</p>\n</li>\n</ul>\n<ul><li><p>2-5 years of hands-on programming experience. Exceptional ability to work anywhere in the technical stack, delivering quality front and back end solutions</p>\n</li>\n<li><p>Expertise across a number of programming languages including: Python, Go, and/or a JVM based language</p>\n</li>\n<li><p>Strong Python Development Skills</p>\n</li>\n<li><p>Knowledge of modern JavaScript toolkit such as AngularJS, React, etc.</p>\n</li>\n<li><p>Some experience (could be academic) with cloud platforms such as Amazon Web Services (AWS) or Microsoft Azure</p>\n</li>\n<li><p>Proven ability to work with varied forms of data infrastructure including relational databases; distributed data processing and storage solutions, e.g. Hadoop/HDFS, Spark, HBase and Cassandra</p>\n</li>\n<li><p>Proficiency building and passionate about creating great products that solve big problems</p>\n</li>\n<li><p>Financial knowledge and interest is recommended</p>\n</li>\n<li><p>Strong teamwork, communication skills and time management abilities</p>\n</li>\n<li><p>Bachelor’s or Master’s degree in Computer Science or engineering preferred</p>\n</li>\n</ul>",
    "job_title": "Python Developer, Associate – Aladdin Wealth Technology(Princeton)"
  },
  {
    "description_text": "<p>CSE Software Inc. is seeking a developer responsible for building server-side application layers (primarily using .NET Core (and Framework for legacy projects)). Your primary responsibility will be to design and develop these layers of our applications, and to coordinate with the rest of the team working on different layers of the infrastructure. A commitment to collaborative problem solving, sophisticated design, and quality product is essential.\n </p>",
    "requirement_text": "<ul><li>Understanding of an object-oriented programming language such as C# or Java\n</li><li>Knowledge of software design patterns, data structures, and best practices\n</li><li>Knack for writing clean, readable, and easily maintainable code\n</li><li>Strong written and verbal communication skills\n</li><li>A passion for learning\n </li></ul>",
    "job_title": "Back-End Developer"
  },
  {
    "description_text": "<p>Looking for a company that inspires passion, courage and creativity, where you can be part of the team crafting the future of global commerce? Want to shape how millions of people buy, sell, connect, and share around the world? If you're interested in joining a purpose driven community that is dedicated to creating a results-oriented and inclusive workplace, join eBay, a company you can be proud to be a part of.</p>",
    "requirement_text": "<ul><li>\nUnderstanding of software design and development practices, solid foundation in computer science with strong competencies in data structures, algorithms, and software design</li><li>\n2 + years experience in object-oriented design methodology and large scale application development in Java (or any other object oriented language)</li><li>\nExcellent understanding of web technologies, distributed systems and service oriented architecture along with web services and related standards like REST/JSON</li><li>\nRelational database and SQL development experience. Understanding of NoSQL databases.</li><li>\n2 + years experience on HTML 5, CSS 3.0, NodeJS is a plus.</li><li>\nExperience with big data solutions such as Hadoop, Hive, Kafka, Storm etc. is a plus.</li><li>\nSelf-motivated and fast learner. Excellent communication, presentation, interpersonal and analytical skills</li><li>\nBS (Computer Science) or other equivalent technical degree + 2 years experience or M.S (Computer Science)</li></ul>",
    "job_title": "Software Engineer, Back End"
  },
  {
    "description_text": "<div>\nIntuit is the global leader in financial management software where we have pioneered the shift to Virtual Platforms, cloud computing for consumers, small businesses and those that serve them. Intuit acts as a 35 year old startup, and we are constantly disrupting ourselves as we identify major new technology and design trends that are needed to deliver our mission to power prosperity around the world. Our groups are fast-paced teams focused on delivering innovative capabilities, and having fun while doing it.</div>\n<div>\nNote: By applying to this position your application is automatically submitted to the following locations: Mountain View,San Diego, and the followingteams at Intuit.</div>",
    "requirement_text": "<ul><li>\nBS/MS in Computer Science or related area or equivalent experience</li><li>\n2+ years of experience developing systems/software for large business environments (Java/J2EE, Python, Go)</li><li>\n2+ years of experience designing complex distributed systems, management products or business applications</li><li>\nStrong experience with Software Engineering/CS fundamentals, including data structures and algorithms</li><li>\nKnowledge of OOD and SOA principles, with ability to implement them in a language of choice\n</li><li>Skilled in software development lifecycle processes and experience with scrum, agile and iterative approaches</li><li>\nAbility to demonstrate unit testing &amp; Test Driven Development (TDD)</li></ul>\n<ul><li>\nExperience in developing applications using microservices, container technologies, container management systems such as Kubernetes, Mesos etc</li><li>\nExperience with Databases design (SQL, NoSQL) and analytics</li><li>\nExperience in utility computing and/or cloud computing domain highly desired</li><li>\nExperience building and deploying applications and services into cloud environments (AWS highly desired)</li></ul>",
    "job_title": "Back End Software Engineer 2"
  },
  {
    "description_text": "<div>The Order Management team is at the core of eCommerce under the Payments organization in eBay. We power all checkout and support all activities on the eBay site that requires money movement and beyond. We build critical software that has immediate impact on millions of eBay users throughout the world.\n</div>\n<div>We are seeking a seasoned software engineer who is passionate about utilizing the latest technologies to bring the best user experience to our customers. You will work closely with the various business units, product management, architecture and operations as well as third party software vendors. We are looking or a self-starter and a team player who is a strong driver for results.</div>\n<div><p>\nYou will collaborate with engineers, business units, product management, architects, and operations teams to build solutions in the Payments domain. Lead and estimate engineering efforts, plan implementations and rollout for applications integrating with cross-functional components. Design, develop and test major features while working in an Agile Scrum team. Utilize Java, Oracle DB, NoSQL, Elastic and other technologies eBay is using, such as NodeJS, HTML, Javascript, CSS, AJAX…etc</p><p><br>\n<b>\nRequirements:</b></p><ul><li>Design, develop and support projects throughout all phases of the software development life cycle</li><li>Develop innovative solutions that meet market needs with respect to functionality, performance, scalability, reliability, realistic implementation schedules, and adherence to development goals and principles</li><li>Participate in all aspects of PDLC including requirement/design reviews as well as code reviews</li><li>Create testing harness/infrastructure/test cases/Automation geared towards ensuring quality of the product</li><li>Estimate engineering effort, plan implementation, and rollout system changes</li><li>Lead product initiatives, recommend improvements, mentor and guide junior team members</li><li>Identify project risks and work effectively to mitigate them</li><li>Share release management duties on feature rollouts,</li><li>Develop industry and product technical expertise</li><li>Find and help fix stability/scalability issues in a very time critical environment</li></ul><p></p><p><b>\nQualifications:</b></p><ul><li>Ability to think out of the box in solving real world problems.</li><li>A portfolio or work samples demonstrating coding skills (e.g links to Github repository from open source contributions).</li><li>Excellent communication, presentation, interpersonal and analytical skills.</li><li>BS and 8+ yrs relevant work experience\n</li><li>MS and 5+ yrs of work experience</li></ul><p></p><p>\nHere at eBay, we love creating opportunities for others by connecting people from widely diverse backgrounds, perspectives, and geographies. So, being diverse and inclusive isn’t just something we strive for, it is who we are, and part of what we do each and every single day. We want to ensure that as an employee, you feel eBay is a place where, no matter who you are, you feel safe, included, and that you have the opportunity to bring your unique self to work.. To learn about eBay’s Diversity &amp; Inclusion click here: https://www.ebayinc.com/our-company/diversity-inclusion/</p></div>",
    "requirement_text": "<ul><li>Design, develop and support projects throughout all phases of the software development life cycle</li><li>Develop innovative solutions that meet market needs with respect to functionality, performance, scalability, reliability, realistic implementation schedules, and adherence to development goals and principles</li><li>Participate in all aspects of PDLC including requirement/design reviews as well as code reviews</li><li>Create testing harness/infrastructure/test cases/Automation geared towards ensuring quality of the product</li><li>Estimate engineering effort, plan implementation, and rollout system changes</li><li>Lead product initiatives, recommend improvements, mentor and guide junior team members</li><li>Identify project risks and work effectively to mitigate them</li><li>Share release management duties on feature rollouts,</li><li>Develop industry and product technical expertise</li><li>Find and help fix stability/scalability issues in a very time critical environment</li></ul>",
    "job_title": "MTS 1 Software Engineer, Back End"
  },
  {
    "description_text": "<div>\nOutreach users navigate through hundreds of prospects, accounts and opportunities a day as part of their daily workflows. Empowering customers to have an intuitive search experience, with the power to generate simple and advanced queries, to explore Outreach CRM data and its relationships, is at the heart of this team’s core mission. We are looking for a Software Engineering Manager to re-envision our Search experience for a multi-tenant environment at massive scale, while ensuring compliance with our security and privacy standards without compromising on a high quality bar for customer experience.<br>\n</div>",
    "requirement_text": "<ul><li>\n3+ years of recent hands-on coding and software design.</li><li>\nRecent experience building robust and scalable software.</li><li>\nA track record of projects completed on time – you are a flawless executor, not a procrastinator. You find satisfaction in a job well done and want to solve head-scratching challenges</li><li>\nSolid OOP and software design knowledge – you should know how to create software that’s extensible, reusable and meets desired architectural objectives</li><li>\nFamiliar with continuous integration environments</li><li>\nPrevious exposure to data-intensive environments, including data modeling and integration conceptsA can-do attitude and good team player.</li><li>\nAbility to prioritize your tasks properly for incremental delivery</li><li>\nExperience with our technical stack: Ruby on Rails, Node.js, Elixir (or comparable functional language such as Golang), ElasticSearch, MySQL, AWS, Docker and Kubernetes.</li><li>\nWillingness to learn new technologies (experience with other languages is okay too, but our code is Ruby on Rails, Elixir and Node.js, so you should be able to get up-to-speed on at least one of them - quickly).</li><li>\nYou embody our core values: We are hungry craftspeople, we have grit, we are honest, we take ownership, we have each other's back no matter what, we're one with our customers, and we find strength in diversity and inclusion.</li><li>\nProficiency in working with services written in Golang is highly desirable</li></ul>",
    "job_title": "Software Engineer (Back-End), Search"
  },
  {
    "description_text": "<p>Work at the Washington Post with the team responsible for building and maintaining the site infrastructure, back end services and publishing pipelines. This team is responsible for delivering the news from the tools used by reporters to the site, apps and distributed platforms for our readers. This team works closely with the rest of the site team, as well as other engineering teams at the Post, by providing centralized content logic as well as shared infrastructure and best practices. We shepherd content from the publishing tools the newsroom uses to our readers across all of our platforms. We build tools that allow the newsroom, and our partners on the front end to surface stories to readers in a meaningful way. Your role on our team will focus on performing technical analysis and designing/developing enhancements of applications based on user requirements. You will also have the opportunity to be involved in a variety of special projects.\n</p>",
    "requirement_text": "<ul><li>Bachelor’s degree preferred; focus in computer science, engineering, business or related technical field preferred.\n</li><li>Minimum of 2 years of relevant technical professional experience required; prior experience in a similar role preferred. Training and certification in lieu of experience will be considered.\n</li><li>Strong analytical, evaluation and problem-solving skills.\n</li><li>Proficient in Python and Flask\n</li><li>Ability to develop solutions by applying relevant technologies and ensuring maintainability, extensibility and code reuse.\n</li><li>High level of proficiency in core language development with good understanding of code optimization and application performance.\n</li><li>Knowledge of testing and quality assurance practices including unit testing and code documentation.\n</li><li>Excellent verbal/written communication and collaboration skills.\n</li><li>Ability to deliver quality solutions within established timelines.\n</li><li>Desirable experience, but not required:\n<ul><li>Celery\n</li><li>Kafka\n</li><li>NGINX\n</li><li>CDN\n</li><li>Mongo\n</li><li>AWS, ECS\n</li><li>Docker\n</li></ul></li></ul>",
    "job_title": "Back-end Software Engineer"
  },
  {
    "description_text": "<ul><li>Manage hosting environments, including database administration and scaling an application to support load changes</li><ul><li>Data migration and transformation using SQL Server 2008/R2</li></ul><li>\nCreate database schemas that represent and support business processes</li><li>\nCollaborate with front-end developers to resolve API issues</li><li>\nhands-on C# coding and optimization to meet aesthetics and business objective\n</li><li>Develop and maintain secure and stateless web services using Microsoft ASP.NET MVC 4.0 based on the REST standard.\n</li><li>Building reusable code and libraries for future use</li><li>\nAbility to analyze and debug issues in a complex client/server environment. This includes the ability to execute both network and database traces and to analyze the results.</li>\n</ul>",
    "requirement_text": "<ul><li>Bachelors in Computer Science or related field</li><li>\nFamiliar with all phases of the software development life cycle and desire to apply this formally in a startup environment.</li><li>\nThorough understanding of front-end technologies and platforms, such as JavaScript, HTML5, and CSS3</li><li>\nFamiliarity with authentication and authorization between multiple systems, servers, and environments</li><li>\nExperience developing in C#</li><ul><li>Experiences with ASP.NET and MVC in C#, Web API\n</li></ul><li>Advanced knowledge in OOP</li><li>\nExcellent written and communication skills</li><li>\nDatabase development using SQL Server a plus</li><li>\nSQL Server maintenance, stored procedure, and MS entity framework a plus</li>\n</ul>",
    "job_title": "BACK-END WEB DEVELOPER"
  },
  {
    "description_text": "<p>We’re always looking for a back end web developer who writes beautiful, scalable code. As a Trainor back end developer, you'll interact with a large variety of projects among our many clients. You'll build and maintain code that allows our clients to tell their stories to the world.</p>",
    "requirement_text": "<ul><li>PHP programming</li>\n<li>Composer package manager</li>\n<li>Git and Version Control Systems</li>\n<li>Deployment systems</li>\n<li>Problem Solving Skills</li>\n<li>Testing and Debugging skills</li>\n</ul>",
    "job_title": "Back End Web Developer"
  },
  {
    "description_text": "<p>Software Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of.</p>",
    "requirement_text": "<div><ul><li>Basic knowledge in one or more of the following technology areas: C++, C, Java, Ruby, Python, Perl, SQL\n</li></ul></div>\n<div><ul><li>Experience working with servers, applications and databases\n</li></ul></div>\n<div><ul><li>Familiarity with APIs\n</li></ul></div>\n<div><ul><li>Basic knowledge of operating systems and how they work (i.e. Operating systems courses); Container technologies; Internet Services; and/or Managed Services\n</li></ul></div>\n<div><ul><li>Understanding of user and system requirements\n</li></ul></div>\n<div><ul><li>Have an interest in, understanding of, or experience with Agile development methodology<br>\n</li></ul></div>",
    "job_title": "Entry Level Back End Developer: 2021"
  },
  {
    "description_text": "<p>We are looking for a full-time <b>Software Engineer 1 - Back-End Developer</b> to join our Marine Cloud team, located at our headquarters in the greater Kansas City area. In this role, you will design, implement, and test new functionality within our complex software ecosystem using the latest tools and technologies. You will solve complex problems by composing small, independent components into large-scale systems. You will interact with business stakeholders and other engineers to ensure we are solving the right problems, the right way.</p>",
    "requirement_text": "<ul><li>C# version 4 or newer</li>\n<li>Experience with creating API's for other teams to consume</li>\n<li>Solid understanding of OOP principals</li>\n<li>Writing and consuming services using Web API</li>\n<li>Microsoft Visual Studio (preferred 2017 or newer)</li>\n<li>MS SQL Server (preferred 2016 or newer)</li>\n<li>Experience with the public cloud (preferred)</li>\n</ul>",
    "job_title": "Software Engineer 1 - Back-End Developer"
  },
  {
    "description_text": "<p>\nStratifyd, Inc. is a B2B tech company located in Charlotte, NC and is fundamentally changing the way brands analyze their data. Stratifyd delivers the most comprehensive, unbiased insights from structured and unstructured data in real time which enables our clients to make confident business decisions faster.</p>\n<p>\nWe are members of the Mastercard Start Path and the Microsoft ScaleUp programs, and we were named a Cool Vendor in Analytics by Gartner. Additionally, we were recently awarded one of \"Charlotte's Best Places to Work\" as well as one of the fastest growing companies in Charlotte by the Charlotte Business Journal!</p>\n<p>\nWe are seeking an analytical, results-driven individual with a passion for developing applications and improving existing ones – someone who knows how to get things done and is not afraid to take on big challenges!</p>\n<p>\nAs a <b>Back-End Software Engineer</b> with Stratifyd, Inc. you will be working collaboratively with a talented group of engineers, designers, and product managers to create a functional, seamless experience for the end-user. In this role, you will build new and innovative features for our AI platform, ensure system consistency, and improve user experience.</p>\n<p><b>\nOur ideal candidate</b> loves building software, has experience building scalable and robust solutions, isn't afraid to dig into existing code to improve it, and can help set the direction of our framework/platform. The Back-End Software Engineer will have demonstrated practical experience in building high-performance and reliable systems and possess a love for Git and all that version control provides (we can also accept a love/hate relationship with Git).</p>",
    "requirement_text": "<ul>\n<li>Bachelor's degree in Computer Science, Engineering, or related field</li>\n<li>1+ year(s) of proven software development experience- <b>Practical industry experience is necessary for this role</b></li>\n<li>Deep understanding of Python idioms and semantics (2.7 and 3.6) and Python/C API</li>\n<li>Professional experience working with systems designed to deliver and operate on streaming data in near-real-time, or personal projects related to the same</li>\n<li>Understanding of Cloud Architecture</li>\n<li>Experience using one or more continuous integration, testing, or deployment frameworks</li>\n<li>You run Linux as your main machine</li>\n<li>Sharp analytical abilities, excellent communication skills, capable of working effectively in a dynamic environment</li>\n<li>Able to find creative scalable solutions to difficult problems</li>\n<li>Strong knowledge of data structures, algorithms, internet security fundamentals and designing for performance, scalability and availability</li>\n<li>A strong desire to explore, learn, and share new technologies, programming languages, and frameworks</li>\n<li>Knowledge of professional software engineering practices &amp; best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations</li>\n<li>Strong sense of ownership, urgency, and drive</li>\n<li>Previous experience working with a smaller dev team preferably in a start-up environment</li>\n</ul>",
    "job_title": "Back End Software Engineer"
  },
  {
    "description_text": "<p>24G is an area leader in creating software and digital solutions for some of the world’s biggest brands. Our team of programmers, designers, and creators design websites, build apps, and more—all from the comfort of our innovative open-office space located in a decommissioned bowling alley. (Score!)</p>\n<p>\nWe’re looking for a backend web developer to join our team. As a backend developer, you will develop, maintain and deploy applications using Node.js. You will have opportunities to use the newest technologies and techniques to develop applications for a diverse array of clients. No degree required!</p>\n<p>\nBut most importantly, we are looking for passionate developers that are eager to grow. If you want to expand your skills in a multitude of areas, if you work well on a team, and enjoy building projects from start to finish, then this is the role for you.</p>",
    "requirement_text": "<ul><li>\n1+ years of Node.js development experience</li><li>\nGood understanding of relational databases</li><li>\nExperience with cloud services (AWS, Google Cloud, etc.)</li><li>\nAbility to build RESTful APIs</li><li>\nFramework experience</li></ul>",
    "job_title": "Back End Web Developer"
  },
  {
    "description_text": "<p>As a <b>Software Engineer</b> with Full Stack capabilities, you will be primarily responsible for developing and testing software products. You are expert in Python and its frameworks and are familiar with front end technologies. Your strong analytical skills and ability to develop innovative solutions will support work critical to decision analysis. You will be involved in application design and architecture. You will be part of a small and active team who will work closely together. We are looking for talented individuals with a serious commitment to software development, and who love to be challenged in innovation and creativity.</p>",
    "requirement_text": "<div><p><b>YOU'RE GOOD AT</b></p>\n<div><ul><li>Collaborating to gather and understand client requirements</li><li>\nDesigning products at scale</li><li>\nCollaborating to design the overall technical architecture of a product</li><li>\nImplementing high quality code in an agile development environment</li><li>\nMaintaining an active role in every part of the product development life cycle</li><li>\nAnalyzing and resolving technical and application problems</li></ul></div>\n</div>\n<ul><li>Bachelor's degree in computer science, engineering, or related discipline is required</li><li>\nStrong Full-Stack Development experience web applications</li><li>\n5+ years of experience in a software development environment</li><li>\nExperience building \"full\" solutions</li><li>\nExperience building Rest APIs</li><li>\nExperience in Agile Processes</li><li>\nGood communication skills</li><li>\nAbility to understand the requirements and to proactively propose software solutions</li><li>\nFluency in English is required</li></ul>",
    "job_title": "Back End Software Engineer - BCG Omnia"
  },
  {
    "description_text": "<p>Currently we're running an Ubuntu LAMP stack on the back-end. Our websites is written in PHP using Drupal CMS and Wordpress. We are looking for a well rounded Drupal Developer to create functional and professional websites that are also highly user friendly. To support and expand this we want to hire more Drupal developers and back end developers with server side expertise.</p>",
    "requirement_text": "<ul><li>All aspects of the LAMP stack and an understanding of what makes web sites tick</li>\n<li>JSON and XML</li>\n<li>General Linux development, source control, and build/packaging tools</li>\n<li>PHP, and a desire to learn other technologies</li></ul>",
    "job_title": "Back-End Developers"
  }
]