[
	{
		"description_text": "<p>The Application Developer - DevOps develops automated business software solutions through scripting, object and data modeling, programming, quality assurance, and implementation support.</p>\n<div><div><div><div><ul><li>Work with Lead and Senior Application Developers to understand business needs and clarify requirements.</li>\n<li>Develop applications to CDW coding standards and quality.</li>\n<li>Collaborate with other developers to determine the optimal solution architecture to ensure application efficiency, maintainability, and scalability.</li>\n<li>Develop system test plans, ensure software quality assurance (SQA) standards are achieved, and validate that business goals are accomplished.</li>\n<li>Complete projects/tasks on a timely basis, according to commitments made to stakeholders and management.</li>\n<li>Report project/task status to the appropriate Application Development Manager on a weekly basis (at minimum).</li>\n<li>Ensure stakeholders are responded to in a timely and professional manner. Foster open lines of communication with all parties.</li></ul><br>\n</div></div></div></div>",
		"requirement_text": "<ul><li>Bachelor’s degree in Computer Science, or equivalent practical knowledge/experience.</li></ul>\n<ul><li>Demonstrated understanding of object-oriented design and programming techniques.</li>\n<li>Excellence verbal and written communication skills, with the ability to effectively interact with all stakeholders, including senior leadership.</li>\n<li>Demonstrated resourcefulness in the software development process and creative problem-problem-solving skills.</li>\n<li>History of balancing multiple priorities simultaneously with the ability to adapt to the changing needs of the business while meeting deadlines.</li>\n<li>Working knowledge in all stages of the software development life cycle: requirements gathering, design, development, testing, and implementation.</li>\n<li>Experience with Windows server configuration including operating systems and components such as IIS</li>\n<li>Experience in .NET &amp; C# programing experience</li>\n<li>Experience scripting with PowerShell, Python, Ruby, and Javascript</li></ul>",
		"job_title": "Application Developer - DevOps"
	},
	{
		"description_text": "<p>The National Renewable Energy Laboratory (NREL), located in Golden, Colorado, has an immediate opening for a researcher to provide strategic research leadership which leverages our cybersecurity research software and emulation tools. The successful candidate will bring experience in performing research within a complex environment, with multiple stakeholders and parallel lines of investigation. Specifically, the role involves developing and applying software tools and platforms to cybersecurity for complex energy and related systems. The role involves regular collaboration with NREL’s domain experts in energy grids, thermal systems, human factors, communication networks, and especially cybersecurity. Highly effective communication skills are required, as the role requires regular interfacing with customers, project stakeholders, and colleagues. The successful candidate will use their experience writing proposals and collaborating with industry to bring funding and shape NREL’s research portfolio.\n</p>",
		"requirement_text": "<p>PhD in Engineering, Public Policy, or closely related fields.\nOr, relevant Master's Degree in Engineering, Public Policy, or closely related fields and 3 or more years of experience.\nOr, relevant Bachelor's Degree in Engineering, Public Policy, or closely related fields and 5 or more years of experience.</p>\n<p>Clearance: Must be able to obtain and maintain a DOE “Q” Security Clearance.</p>\n<ul><li>Eligibility requirements: To obtain a clearance, an individual must be at least 18 years of age; U.S. citizenship is required except in very limited circumstances. See DOE Order 472.2</li></ul>",
		"job_title": "DevOps Platform Lead"
	},
	{
		"description_text": "<p>We are the world’s learning company with more than 24,000 employees operating in 70 countries. We combine world-class educational content and assessment, powered by services and technology, to enable more effective teaching and personalized learning at scale. We believe that wherever learning flourishes so do people.</p>\n<p>The Data Ops Engineer is part of a team responsible for supporting Enterprise Data Warehouse (EDW), custom reporting, and the organization's on-demand data needs. Under the direction of the Manager of EDW Systems, this individual will build, troubleshoot, optimize the infrastructure, data, and ML CI/CD pipelines and application monitoring in the GCP (Google Cloud Platform).</p>\n<p>This is a great opportunity to be exposed to a host of services, like Google AppEngine, Kubernetes Engine, Jenkins, terraform, Big Query, Stack driver monitoring, Pager duty alerting, docker containers etc. and other industry leading tools and latest cutting-edge technologies.</p>",
		"requirement_text": "<ul><li><p>B.S. degree, or equivalent, in Computer Science, Information Systems or related field</p></li>\n<li><p>\n0-2 years of project work experience</p></li>\n<li><p>\nBasic knowledge of scripting skills</p></li>\n<li><p>\nThe ability to learn new technologies quickly</p></li>\n<li><p>\nStrong analytical and problem-solving skills</p></li>\n<li><p>\nStrong oral and written communication skills (English)</p></li>\n</ul>\n<ul><li><p>Any experience or internships as a DevOps engineer.</p></li>\n<li><p>\nExposure to any cloud environments like AWS, GCP or Azure</p></li>\n<li><p>\nExposure to creating infrastructure as code</p></li>\n<li><p>\nUnderstanding of ITIL principles</p></li>\n</ul>",
		"job_title": "Data Ops Engineer, ENTRY LEVEL"
	},
	{
		"description_text": "<p>We believe work is not a place, but rather a thing you do. Our technology revolves around this core philosophy. We are relentlessly committed to helping people work and play from anywhere, on any device. Innovation, creativity and a passion for ever-improving performance drive our company and our people forward. We empower the original mobile device: YOU!</p>\n<p>\nYou are a Staff Software Engineer with at least 7-8 years of experience with a keen interest in DevOps. You should have hands on programming skills and extensive knowledge of build systems, CI/CD, automated systems, scripting languages and frameworks, and a passion for solving complex problems. Enjoy working in a dynamic, fast-paced environment to deliver innovative solutions. You will have the opportunity to grow your skillset while working with a variety of cutting-edge technologies and tools. The HDX team empowers the virtualization technologies at the heart of Citrix products. Our culture is a unique blend that combines the structured vision and process maturity of a well-established software company with the dynamism and vibrancy of a small startup.</p>",
		"requirement_text": "<ul><li>BS or MS degree or equivalent in a technical field preferred, with at least 7-8 years of directly related work experience. Equivalent experience may be substituted for formal education.</li><li>Hands on experience with Continuous Integration &amp; Continuous Deployment tools and processes.</li><li>Software Development experience, including the full development lifecycle – Design, estimation, implementation, release and support</li><li>Experience with Jenkins and TeamCity, building multi-platform applications, including Windows and Linux platforms.</li><li>Proficiency with Groovy, Jenkins Scripted Pipelines and Shared Pipeline Libraries.</li><li>Extensive knowledge of Developer Tools such as Visual Studio, MsBuild, CMake, GCC and Clang.</li><li>Familiar with source control management systems including BitBucket, Git and GitHub.</li></ul>",
		"job_title": "Staff DevOps Engineer, HDX Team"
	},
	{
		"description_text": "<p>\nThe DevOps operating model is the combination of cultural philosophies, practices, and tools that helps organizations deliver end-to-end applications and infrastructure solutions safely and at high velocity. The DevOps Consultant is the emerging leader with previous experience in a lead DevOps role. The Consultant will assist on larger projects or run smaller opportunities independently. A successful candidate has technical depth and hands-on implementation experience of various practices and tools in the DevOps toolchain. The Consultant is comfortable rolling up their sleeves to design and code modules for infrastructure, application, and processes.</p>",
		"requirement_text": "<ul>\n<li>Bachelor Degree or equivalent professional or military experience.</li>\n<li>5+ years of experience as a technical specialist.</li>\n<li>2+ years of strong hands-on experience of programming in Python, Ruby, Go, Swift, Java, .Net, C++ or similar object oriented language.</li>\n<li>Experience with cloud native technologies.</li>\n<li>Hands-on experience with code merging and promotion and building and managing CI/CD workflows and tools.</li>\n<li>Experience with the full software development lifecycle and delivery using Agile practices.</li>\n</ul>\n<ul>\n<li>Experience with CloudFormation, Chef, Puppet, Salt, or Ansible in production environments.</li>\n<li>Knowledge of IP networking, VPN's, DNS, load balancing and firewall.</li>\n<li>Experience with monitoring and log aggregating frameworks.</li>\n<li>Management of continuous integration servers like Jenkins, Bamboo and TeamCity</li>\n<li>Experience with development and automated testing.</li>\n<li>Understanding of microservices and distributed application architecture.</li>\n<li>Strong verbal and written communication skills, with the ability to communicate core DevOps concepts (CI/CD, Agile &amp; Automation).</li>\n</ul>",
		"job_title": "DevOps Consultant - Nationwide Opportunities"
	},
	{
		"description_text": "<p>\nHabana Labs is an innovative company focused on developing purpose-built AI processors, disruptive solutions that will shape the future of AI &amp; Deep Learning computing. Our vision to take AI processing from its current limits to the peak of its potential continues. We are looking for exceptionally smart and driven people who believe AI will change the world and would like to join us on our exciting journey.<br>\n<br>\nWe are looking for experienced DevOps Engineers to support our DataCenter automation. In this role, you will develop and employ continuous integration and deployment in support of our evolving CI/CD process. You will engage with the SW Development Engineers to build and maintain a seamless development flow and tackle large scale optimization challenges. The ideal candidate will be self-motivated, have excellent communication skills, creativity and a willingness to continuous learning.</p>",
		"requirement_text": "<ul><li>\nBachelor’s degree in computer science, information technology, computer systems, or a related field with 3+ years of experience.</li><li>\n1+ years’ experience developing and writing CI/CD pipelines such as: Jenkins, Github, Artifactory, or other.</li><li>\n1+ years’ experience of proven scripting knowledge such as: Bash, Python, or other.</li><li>\n1+ years’ experience with containerization such as: Docker, Kubernetes, or other..</li></ul>",
		"job_title": "DevOps Engineer, Habana Labs"
	},
	{
		"description_text": "<p>SmartBear helps the world's most recognized companies develop the best applications. We are a growing medium-sized company with locations around the country and around the world. SmartBear has played a role in the Uber you ordered, the banking app you use, the item you posted for auction, or that flight you just purchased. Our software is downloaded every 6 seconds (5.25 million downloads a year) and we have over 25,000 customers (Google, Apple, Microsoft, Uber, GE and SalesForce to name a few) in 194 countries</p>",
		"requirement_text": "<ul>\n<li>2-4 years' experience in a DevOps role or Agile organization</li>\n<li>Hands on experience preferable with host and cloud infrastructure, most notably AWS</li>\n<li>Working knowledge of VPC's, Route53, EC2 Infrastructure, S3 Buckets, Cloud Watch, IAM, Cognito, and RDS</li>\n<li>Knowledge of one or more scripting languages such as bash, Python, or Groovy used in DevOps life cycles</li>\n<li>Automate build and deployments with GitHub, Jenkins, Rancher, Nexus, Sonarqube</li>\n<li>Kubernetes deployments a plus</li>\n<li>Experience with Packer/Terraform a plus</li>\n<li>Experience with security monitoring software and tools such as VeraCode, WhiteSource and Detectify a plus</li>\n</ul>",
		"job_title": "DevOps Engineer"
	},
	{
		"description_text": "<p>\nCome and join us! Intel is seeking highly qualified candidates to join the BXD (Barefoot Switching Division) in our Data Platform Group (DPG) as a Software DevOps Engineer! We're part of the Connectivity Group (CG) in Intel's DPG, and are looking for motivated, passionate and talented software devops engineers to join our Software team for programmable high-speed switching ASICs. We're a strong, vibrant, cross-site team that helps drive Intel's programmable switching technology and products to position Tofino as the switching platform of choice for Cloud and Data Center network deployments.<br>\nIn this role, you will be responsible for maintaining build, release and test infrastructure.Responsibilities will include, but are not limited to:<br>\n<br>\nThe ideal candidate will have the following skills in addition to the qualifications listed below.<br>\n<br>\nMust be a team player, with a demonstrated effectiveness in technically influencing others.<br>\nStrong problem-solving skills.<br>\nExcellent verbal and written communication skills.<br>\n<br>\nIn this position you will gain invaluable experience which will allow growth and expanded opportunities within this business group as well as future possible opportunities with other business groups within Intel.www.intel.com/jobs/datacenter</p>",
		"requirement_text": "<p>Bachelor's degree in Computer Science or related field plus 4+years of industry work experience or Master's degree in Computer Science or related field plus 3+ years of industry work experience</p>\n<p>\n2+ years of DevOps Engineering experience</p>\n<p>\n2+ years of experience in Linux systems<br>\n2+ years of experience in shell scripting<br>\n2+ years of experience in JIRA, Github and Jenkins<br>\n2+ years of automation using Python<br>\n2+ years of CI/CD experience</p>",
		"job_title": "Software DevOps Engineer"
	},
	{
		"description_text": "<p>\nAre you passionate about open source technology? Do you love building new things? Do you want to develop the future of IBM's Cloud offerings? If you answered YES, then we have the right opportunity for you! We are looking for Software Developers and DevOps Engineers to join our team. Work on the next generation IBM cloud compute, platform integration, and infrastructure solutions. Candidates will have the opportunity to learn about and work with interesting technologies to build and deliver cloud capabilities that will delight our customers. We make sure our engineers understand the end to end vision of each project and are given the opportunity to work across teams and the organization to deliver that vision.<br>\n<br>\nRole Summary:<br>\nAs a DevOps Engineer you will work in a Kubernetes based micro services environment to support our leading edge cloud services. This will include custom solutions, as well as open source DevOps tools (build and deploy automation, monitoring and data gathering for our software delivery pipeline). You will also be contributing to our continuous improvement and continuous delivery while increasing maturity of DevOps and our agile adoption practices.<br>\n<br>\nExperience with tunable and scalable cloud deployments is also preferred. If you are passionate about scalable system software and cloud development, if you enjoy not only sharing a vision, but getting your hands dirty to be sure that our vision is made a reality in a fast-paced, challenging environment, then we would love to talk to see if we have that perfect opportunity for you!<br>\n<br>\nPreferred Locations : Littleton, MA or Austin, TX<br>\n</p>",
		"requirement_text": "<ul><li>Delivering micro services at scale; designing micro services solutions</li><li>Cloud experience / delivery of applications with AWS, Azure or Google Cloud</li><li>Kubernetes / Docker</li><li>Container performance and security</li><li>Scripting languages - Python, shell</li><li>Release Engineering (Branching, versioning, tagging)</li><li>Experience with Agile software development</li><li>OOO programing language</li><li>Go Language experience</li><li>Artifact repository, Artifactory, Nexus</li><li>CI/CD tooling (Concourse CI, Travis, Jenkins)</li></ul>",
		"job_title": "DevOps Engineer"
	},
	{
		"description_text": "<div>Great ideas sometimes come from singular inspiration, but more often they’re a result of collaborative effort. Inside Garmin, we like to foster an environment of participation and engagement. We support professional development, offer well-designed career paths and adhere to a policy that prioritizes promoting from within the company to maximize the opportunities for our associates. We are also committed to being a good corporate citizen and providing opportunities for associates to contribute toward a healthy, sustainable world.</div>\n<div><br>\nAssociates get the royal treatment at Garmin. Regardless if you’re a newbie or a veteran, engineers dream it, design it and use it. Here, you will be surrounded by others who share the same passion about what they do every day. We offer a relaxed team environment (no dress code!) where advancement is found from sharing knowledge, not hiding it! While we promise you a lot of responsibility, you also will have the opportunity to have ownership over projects…oh, and we promise you there will be some fun mixed in there, too!</div>\n<div><br>\nAt Garmin, we create products that solve complex problems and make people’s lives safer, healthier and more enjoyable. Whether you are interested in developing software using Java, Javascript, C# or more, we have a future for you.</div>",
		"requirement_text": "<ul><li>Demonstrated strong and effective verbal, written, and interpersonal communication skills</li>\n<li>Must demonstrate relevant experience and/or training in a low, mid, or high-level language such as Python, Bash, or other selected languages</li>\n<li>Must possess relevant experience and/or training in cloud computing methodology relevant to Garmin’s business need</li>\n<li>A cumulative GPA greater than or equal to 3.0 and previous experience working in a team environment is highly preferred!</li></ul>",
		"job_title": "Software Engineer 1 - DevOps (Boulder, CO)"
	},
	{
		"description_text": "<div> <p>As a member of Ascendum’s DevOps team, you will work with clients and other teams in the organization to meet the technical operational needs of services, products and other facilities requested. We will be working in a variety of infrastructures, including on-premises bare hardware, Azure, AWS and hybrid configurations. You will be expected to follow the best practices set by industry standards and/or company standards. While potentially working on several different projects at once, we will be expected to be as flexible as possible while ensuring we deliver a quality product or service to our customers. You will report directly to the manager of DevOps and attend regularly scheduled meetings to ensure the team is on-task and we have a clear view of the requests before us.</p> </div>",
		"requirement_text": "<ul><li>2-4 years of experience working within a DevOps Engineering role</li> <li>Hands-on knowledge with scripting, preferably shell (Bash) and Python</li> <li>Familiarity with Mobile (Android and iOS) and handling mobile application lifecycles such as versioning, app stores and how they handle dev/release pipelines</li> <li>Experience with CI/CD tools and platforms such as Jenkins, TravisCI, Azure DevOps, Github Actions</li> <li>Experience with CI/CD methodologies and best practices</li> <li>Excellent communication and process skills, able to articulate points clearly</li> <li>Advanced knowledge of cloud infrastructure services and systems such as Azure, AWS, and GCP</li> <li>Experience with using monitoring tooling such as Zabbix, New Relic, and/or LogicMonitor</li> <li>Practical experience with using configuration management suites such as Puppet, Chef, Terraform</li></ul>",
		"job_title": "DevOps Engineer"
	},
	{
		"description_text": "<div> <p> The Capgemini Freelancer Gateway is enabled by a cutting-edge software platform that leads the contingent labor world for technology innovation. The software platform leverages Machine Learning and Artificial Intelligence to make sure the right people end up in the right job.</p><p></p><br> <p> A global leader in consulting, technology services and digital transformation, Capgemini is at the forefront of innovation to address the entire breadth of clients’ opportunities in the evolving world of cloud, digital and platforms. Building on its strong 50 year heritage and deep industry-specific expertise, Capgemini enables organizations to realize their business ambitions through an array of services from strategy to operations. Capgemini is driven by the conviction that the business value of technology comes from and through people. It is a multicultural company of over 200,000 team members in more than 40 countries. The Group reported 2018 global revenues of EUR 13.2 billion.</p></div>",
		"requirement_text": "<ul><li> DevOps engineer with AWS Collaboration with multiple teams</li><li> Strong communication skills</li><li> UNIX/Linux Networking skills</li><li> Scripting languages: Perl and Python </li><li>Ability to work independently, good collaboration with other teams and ability to learn new technologies.</li><li> Understanding of front end web development/UI 5. </li><li>Ansible- nice to have</li></ul>",
		"job_title": "AWS DevOps Engineer"
	},
	{
		"description_text": "<div><p> As a modernized technology company, our Slalom Technologists are disrupting the market and bringing to life the art of the possible for our clients. We have passion for building strategies, solutions and creative products to help our clients solve their most complex and interesting business problems. We surround our technologists with interesting challenges, innovative minds and emerging technologies.<br> </p><p></p><br> <p><b>What You’ll Do </b></p><ul><li>Responsible for understanding business problems and designing, developing / configuring, testing, and deploying software to provide the solution. </li><li>Building pipelines, test strategy, and cloud environments to be used in part of the development processes. </li><li>The DevOps Engineer’s responsibility is to ensure the delivery of the software is high quality and automated as much as possible.</li></ul></div>",
		"requirement_text": "<ul><li>2-4 years experience in DevOps, SecOps, Networking/Security, Cost Management, IAM, IaC (Cloudformation, Terraform), CI/CD Tools and automation</li><li> AWS or other Cloud experience</li><li> Experience interacting/participating in CCOE (Cloud Center of Excellence)</li><li> You would enjoy this role if you’re passionate about understanding challenging business problems and curious about new technologies. </li><li>You love the big picture of software development that expands beyond the IDE like testing, infrastructure, CI/CD, releases, and operations.</li></ul>",
		"job_title": "DevOps Engineer"
	},
	{
		"description_text": "<div><p>Are you interested in working with the latest and greatest cloud technologies? Cloud Platform &amp; Automation (CPAT) team drives transformation of traditional Ops to Devops, streamlining cloud management and builds self service capabilities to empower users. . You will have the opportunity to be involved in a variety of exciting projects, building robust and automated platform capabilities across key hyperscale cloud providers, using modern DevOps practices and Infrastructure-as-Code. </p><p></p><p>Your responsibilities may include some or all of the following... </p><ul><li><p>Create innovative solutions to solve complex problems and optimize MSI cloud landscape, leveraging cloud native capabilities, AI/ML and other advanced technologies </p></li><li><p>Automate cloud deployments in Azure and AWS with infrastructure-as-code </p></li><li><p>Develop tools and services to improve consistency &amp; operational efficiencies in cloud </p></li><li><p>Build and manage CI/CD pipelines (Jenkins, Azure DevOps, etc) </p></li><li><p>Build dashboards to provide visibility, and UI to empower users and admins with self-service capabilities </p></li><li><p>Execute POCs, migrate/setup application workloads on Azure and AWS </p></li><li><p>Develop policies and standards for cloud services and automate technical enforcement to enhance the security posture<br> </p></li></ul> </div>",
		"requirement_text": "<ul><li><p>Strong Software Development proficiency in one or more languages - Python, Java, PowerShell, NodeJS, AngularJS, etc </p></li><li><p>Good understanding of infrastructure concepts (Linux or Windows, DNS, Network, Firewalls and Security) </p></li><li><p>Proficiency with AWS and/or MS Azure </p></li><li><p>Knowledge of SDLC/Agile practices and tools - CI/CD pipeline, code reviews, Jenkins, Jira, etc </p></li><li><p>Self-motivated, team player who demonstrates initiative and flexibility. </p></li><li><p>Willingness to learn new technologies and adapt </p></li><li><p>Self organized, ability to handle and prioritize multiple tasks </p></li></ul>",
		"job_title": "Cloud DevOps 2021 Internship"
	},
	{
		"description_text": "<div><div><p> RxAdvance has a Full Time W2 position with standard benefits for a Junior DevOps Engineer.</p> <p> Junior DevOps Engineer will be responsible for<b> </b>hands on Deployment, Orchestration and management of cloud native solutions. The ideal candidate will take a pragmatic and iterative approach to build solutions in collaboration with other internal and external developers. The incumbent should be passionate and boundaryless with a demonstrated track record of delivering robust, stable and sustainable solutions. The ability to absorb new technologies, understand synergies with existing enterprise tools and the skill to leverage both to the maximum extent is a key component of this position.</p> </div></div>",
		"requirement_text": "<ul> <li>Bachelors of Computer Science.</li> <li>2+ years of experience working within a DevOps Engineering role.</li> <li>Good understanding of Cloud native technologies, Containerization (Preferable Dockers), Container Orchestration (Preferable Kubernetes)</li> <li>Hands-on knowledge with scripting, preferably shell (Bash) and Python</li> <li>Implement systems that are highly available, scalable, observable and self-healing.</li> <li>Define and deploy observability systems enabling teams to gain technical and business insights and avoid system failures via metrics, logging and tracing.</li> <li>Design, manage, and maintain tools to automate operational processes.</li> <li>Understand, implement, and automate security controls, governance processes, and compliance validation</li> <li>Design, build, and monitor log aggregation and other alerting systems and processes.</li> <li>Demonstrated ability to design and implement a configuration management platform, with process and modern technologies, across multiple virtual / hybrid environments.</li> </ul>",
		"job_title": "Junior DevOps Engineer"
	}
]