[
  {
    "description_text": "<ul>\n<li>BS level technical degree or equivalent professional or military experience</li>\n<li>5+ years of professional front end development around the user experience</li>\n<li>Experience with responsive web design</li>\n<li>Experience in developing rich applications with HTML, CSS, JavaScript</li>\n<li>Experience developing web services using any of the following: Python, Java, Node.js, Ruby, Go, .NET or Scala</li>\n<li>Experience in one or more relevant front-end frameworks (React, Angular, Ember, Vue.js, Thymeleaf, etc.) and test frameworks (Jest, Mocha, Jasmine, Selenium, etc.)</li>\n<li>Experience with view layout and rendering technologies (e.g., responsiveness, progressive enhancement, browser/device support)</li>\n</ul>",
    "requirement_text": "<ul>\n<li>Helping customers develop scalable applications with rich user experiences</li>\n<li>Working as a technical leader alongside customer business, development and infrastructure teams</li>\n<li>Providing deep software development knowledge with respect to front end architecture, UX/UI design, and programming</li>\n<li>Advising and implementing AWS best practices</li>\n</ul>",
    "job_title": "Front End Developer - Nationwide Opportunities"
  },
  {
    "description_text": "<p>At AKQA we believe in the imaginative application of art and science to create beautiful ideas, products and services. With an entrepreneurial and collaborative approach, we design adaptive digital services and applications that capture the imagination, delivering impressive returns for our clients.</p>\n<p>AKQA Front-End Developers have a strong dedication to recent and upcoming technologies, as well as the drive to develop innovative technical solutions.</p>\n<p>You will participate in the creation of sophisticated digital experiences and must have advanced understanding of front-end web development. You will work with a team of highly skilled people – each with strong opinions about various technologies, frameworks and approaches to delivery.</p>",
    "requirement_text": "<ul>\n<li>You are an effective JavaScript programmer who doesn't need to rely on libraries to accomplish innovative interactions</li>\n<li>You are aware of the interplay between JavaScript and HTML and CSS, and you can dynamically create, modify, and style elements on a page with ease</li>\n<li>You have an understanding of major browsers and the special considerations required for them</li>\n<li>Strong knowledge responsive web design</li>\n<li>Experience with translating comps and wireframes into flexible and usable code</li>\n<li>Experience with version control software</li>\n<li>Experience with Photoshop</li>\n<li>Experience with developing large customer-facing websites</li>\n<li>Must have at least 3+ years of experience working as a front-end developer</li></ul>",
    "job_title": "Front-End Developer"
  },
  {
    "description_text": "<p>As a Front-End Developer, you will help develop interfaces for our various platforms and services. The work you do will help shape the products and tools used internally and will positively impact the experience of thousands of customers that visit our site each day.</p>\n<div>\n<p>Whether you are at our corporate office or a remote employee, you'll enjoy the same training and support to be successful in your position. We stay connected through video meetings, training sessions, and collaborative forums, and provide opportunities for you to connect with other employees from across the country both professionally and personally.</p>\n</div>",
    "requirement_text": "<ul><li><p>Write semantic, and accessible HTML</p>\n</li>\n<li><p>Confidently write CSS and is familiar with SASS or LESS preprocessors. Experience working with Tailwind.css is a plus.</p>\n</li>\n<li><p>Be able to navigate designs created in Figma, Sketch, etc. and translate the designs into code.</p>\n</li>\n</ul>\n<ul><li><p>Have an interest in building UIs with modern tools like VueJs, and WebPack.</p>\n</li>\n<li><p>Track, and communicate code changes using GIT for version control</p>\n</li>\n<li><p>Work within scrum/agile methodologies</p>\n</li>\n<li><p>Have 3+ years of Front-End development experience using modern JavaScript frameworks. An understanding of .NETCore or PHP would be a plus, but not a requirement.</p>\n</li>\n</ul>",
    "job_title": "Front-End Developer"
  },
  {
    "description_text": "<p>Phase2 Technology is looking for a developer with a strong design background, and who focuses on front-end development and prototyping, to join our expanding team. The ideal candidate is a passionate problem solver who applies their technical experience to create compelling and useful digital experiences. You will collaboratively draft standards for visual design, maintain libraries of assets, and implement responsive, user-centered and accessible sites using a variety of technologies.</p>",
    "requirement_text": "<ul><li>Must Have: knowledge and experience with Drupal 8</li>\n<li>Strong knowledge of CSS, HTML, PHP/MySQL, JavaScript, Twig and experience building modern responsive sites</li>\n<li>Node / React / Angular experience</li>\n<li>Experience with Git</li>\n<li>Experience with Drupal 8 performance, security concerns and troubleshooting skills</li>\n</ul>",
    "job_title": "Front End Developer"
  },
  {
    "description_text": "<p>Enovational Corp is a fast growing technology startup building web and mobile applications. We specialize in delivering award-winning user experiences paired with solid technology, as both client solutions and our own consumer products. And we believe our successes come from our teamwork and mutual respect for each other’s talents and unique perspectives.</p>\n<p>\nSo when we say we are looking for a front-end developer, yes, we are looking for someone with HTML, CSS, and Javascript prowess and an eye for design, but what we’re hoping for is someone willing to go beyond it into animations, interactions and usability, and even venture into full stack development to help us shape amazing products.</p>",
    "requirement_text": "<ul>\n<li><p>\nHave amazing attention to detail and delight in creating polished and seamless digital experiences.</p></li>\n<li><p>\nBring a passion to stay on top of tech trends, experiment with and learn new technologies.</p></li>\n<li><p>\nCan be flexible, agile, dependable, and responsive even when there are a lot of moving parts and prefer that over following rigid processes and guidelines.</p></li>\n<li><p>\nBelieve that good application development includes good testing, good documentation, and good collaboration.</p></li>\n<li><p>\nHave great communication and reasoning skills, including the ability to make a strong case for technology choices while understanding other viewpoints and the need to find the best possible solution for everyone.</p></li>\n<li><p>\nHave a positive yet practical attitude; You are willing to take on any task that might help take one of our products, or our company, a little further.</p></li>\n</ul>",
    "job_title": "Front-End Developer"
  },
  {
    "description_text": "<p>ETI is a small, international software company with a record of innovation, helping telecoms and ISPs manage, understand, and gain insight into their networks, equipment, and services. We are bringing a new product to market which needs a fantastic UI and UX, with amazing visualisations to explore and understand a variety of data. We a need a confident developer who loves to learn and wants to bring new ideas and perspectives to our team.</p>",
    "requirement_text": "<ul>\n<li>design and build web UIs</li>\n<li>write code in JavaScript</li>\n<li>demonstrate UX knowledge</li>\n<li>work with open-source software</li>\n</ul>",
    "job_title": "Web Front End Developer"
  },
  {
    "description_text": "<p>Founded in 1985, STR provides premium data benchmarking, analytics and marketplace insights for global hospitality sectors. STR was acquired in October 2019 as a division of CoStar Group, Inc., the leading provider of commercial real estate information, analytics and online marketplaces. STR is in the process of combining the commercial real estate industries largest and most up to date properties database with STR’s global hospitality performance data to give both real estate and hospitality customers a unique and powerful combined view of their local markets.</p>\n<p>\nThe Applications Services team works with the CoStar Analytics team to develop customer-facing Hospitality benchmarking products. We think big; creating innovative data-intensive applications that take the vast amount of data collected from STR clients and by the CoStar Research teams to create a fast, reliable and intuitive analytics platform for customers. We are a collaborative group with a mix of big data, API/platform and front-end skills, and we are growing rapidly to help invent the future of Hospitality benchmarking and analytics.</p>\n<p>\nWe are searching for a motivated and energetic Associate Front-End Developer who takes initiative, enjoys finding solutions to a varying number of challenges, is detail-oriented, and takes extreme pride in their work to join our Hendersonville team and contribute to these critical products.</p>",
    "requirement_text": "<ul><li>\nBachelor’s degree, preferably in Computer Science/Engineering.</li><li>\n1+ years of professional front-end software development experience.</li><li>\nKnowledge of modern JavaScript and JavaScript frameworks.</li><li>\nKnowledge of HTML5, CSS3, and CSS preprocessors.</li><li>\nExposure to software development best practices, including standards, code reviews, source control, builds, testing and operations.</li><li>\nStrong analytical and problem-solving abilities.</li></ul>\n<ul><li>\nExposure to Source Control, such as Git or TFS.</li><li>\nExposure to Cloud platforms such as AWS or Azure is a plus.</li><li>\nExperience with React, TypeScript, Webpack, and NodeJS a big plus.</li><li>\nExposure to testing frameworks such as Jest, Mocha, and Chai.</li></ul>",
    "job_title": "Associate Front End Developer"
  },
  {
    "description_text": "<p>CSE Software Inc. is looking for a Front-End Developer who is motivated to combine the art of design with the art of programming. The primary responsibility will be translating the UI/UX design wire frames to actual code to produce visual elements for the application. You will work with the UI/UX designer and bridge the gap between graphical design and technical implementation, taking an active role on both sides and defining how the application looks, as well as how it works.\n</p>",
    "requirement_text": "<ul><li>Proficient in web markup, including HTML5 and CSS3\n</li><li>Basic understanding of server-side CSS pre-processing platforms, such as LESS or SASS\n</li><li>Proficient in client-side scripting and JavaScript frameworks, including jQuery\n</li><li>Intermediate understanding of Angular or Vue\n</li><li>Intermediate understanding of asynchronous request handling, partial page updates, and AJAX\n</li><li>Basic knowledge of image authoring tools used to crop, resize, or perform small adjustments on an image. Familiarity with tools such as Gimp or Photoshop is a plus.\n</li><li>Proficient in cross-browser compatibility issues and ways to work around them\n</li><li>Proficient in code versioning tools, such as Git\n</li><li>Typescript knowledge a plus\n</li></ul>",
    "job_title": "Front-End Developer"
  },
  {
    "description_text": "<p>\n36 is looking for a talented front-end developer who can turn designs into rich, interactive user experiences. Being capable of creating intuitive cross-browser and device-agnostic experiences using the latest technologies is a must. Knowledge in front-end performance and optimizations, along with build automations, is strongly desired.</p>\n<p>\nCandidates must have strong communication skills and be well-versed in current web standards, including the best practices for development and the desire to learn to technologies. An impeccable attention to detail is a must.</p>",
    "requirement_text": "<ul><li>Ability to communicate with users and stakeholders at all levels, strong problem solving skills, and proactive and intuitive decisions are a must</li>\n<li>Ability to work as a teammate, including integration into build processes</li>\n<li>Expert understanding of web technologies, languages, layout techniques, etc.</li>\n<li>Ability to test and debug code in many different environments</li>\n<li>Experience in using GIT and ticket or task-based systems</li>\n<li>Experience with 3rd party libraries and APIs</li>\n<li>Desire to learn new technologies</li>\n<li><i>Visual regression testing know-how a plus</i></li>\n<li><i>2d and 3d animations a plus</i></li>\n<li><i>LAMP experience a plus</i></li>\n<li><i>PHP knowledge a plus</i></li></ul>",
    "job_title": "Front-end Developer"
  },
  {
    "description_text": "<div>\nWe are looking for highly motivated Front-End Engineer with proven experience in designing and creating complex systems from scratch. You will join an experienced team of engineers to create and prototype end-to-end solutions involving multiple Artificial Intelligence problem. If your interest is in the AI and Robotic Process Automation space then you’re at the right place. Innovation is the core of our business. We don’t want to just create great technology we strive to be the best at it. In addition, we offer excellent benefits and a collaborative culture. Join us and let’s create disruptive technology together!</div>",
    "requirement_text": "<ul><li>Work closely with UX and visual designers to build out front-end styles for responsive applications and best in class experiences</li><li>Develop new user-facing features and be actively involved in continuously improving the platform</li><li>Deliver high quality peer-reviewed code that follow engineering best practices\n</li><li>Write reusable code and build libraries for future use\n</li><li>Optimize application for maximum speed and scalability\n</li><li>Collaborate with other team members and stakeholders\n</li><li>Create and prototype end-to-end solutions of complex product features</li><li>Design and implement API</li><li>Integrate machine learning frameworks and solutions with product</li></ul>",
    "job_title": "Front-End Developer"
  },
  {
    "description_text": "<p>We are looking for talented web developers to work closely and collaboratively with our design team to create extraordinary, award-worthy website experiences.</p>",
    "requirement_text": "<div><p>The ability to create visually amazing, world-class work is a requirement — your portfolio is the best way to show your skills for this role. Knowledge of web UI frameworks is less important.</p>\n<p>\nWe value diversity and welcome applicants from underrepresented groups.</p>\n<p>\nhandsome is a holistic experience design agency. We work with the world’s most innovative brands to create digital products, services, and businesses that help them thrive in a progressively connected world. Our client partnerships include FedEx, Keller Williams, Dell, Facebook, Home Depot, Nickelodeon and others.</p>\n</div>",
    "job_title": "Front-end Developer"
  },
  {
    "description_text": "<p>\nWorking as a <b>Front-end Developer</b> at Cooper Lighting Solutions is dynamic. You will directly contribute to the development and expansion of our cutting-edge cloud connected Internet of things (IoT) and standalone product applications and offerings. You will be involved in the complete software development life cycle including after delivery support, service pack or bug fix releases.</p>",
    "requirement_text": "<ul><li><p><b>\nBachelor’s Degree in software engineering or computer science or 4+ years of equivalent experience in lieu of a 4 year degree</b></p></li><li><p><b>\n3+ years of software development experience with web-based cross-browser applications using HTML5, CSS3, JavaScript frameworks (ReactJS or AngularJS) , Bootstrap, JSON, &amp; AJAX</b></p></li><li><p><b>\nExperience consuming REST Web services</b></p></li><li><p><b>\nThorough working knowledge of Document Object Model (DOM)</b></p></li><li><p><b>\nUnderstanding of ECMAScript 6 (ES6)</b></p></li><li><p><b>\nExperience using less, sass, gulp or grunt</b></p></li></ul>",
    "job_title": "Front-end Developer, Cooper Lighting Solutions"
  },
  {
    "description_text": "<p>The position is for a Front End Software Engineer. The candidate will be working as part of our team driving, designing, creating and maintaining components of our websites. The ideal candidate will possess an understanding of web development, utilizing languages such as React.js, Angular.js, Java, Webpack, and Node.js.</p>",
    "requirement_text": "<ul><li>\nBachelor’s degree or four or more years of work experience.</li><li>\nFour or more years of relevant work experience.</li></ul>",
    "job_title": "Front End Software Engineer"
  },
  {
    "description_text": "<p>\nThe Web Eats engineering team works on all the consumer facing features of UberEats.com. We cover a broad range of functionality from discovery, search, ordering, delivery experience along with behind the scenes tech like analytics, DDos mitigation etc.\n</p>",
    "requirement_text": "<ul><li>\nYou have knowledge of a backend stack (some examples include: Java, Node.js, Python, Redis, Kafka, Golang or similar).</li><li>\nAbility to learn quickly on the go. We're looking for software engineers who thrive while learning new technologies and don't believe in one-size-fits-all solutions. You should be able to easily adapt to meet the needs of our massive growth and rapidly-evolving business environment.</li><li>\nBias toward action. You believe that speed and quality aren't mutually best-in-class. You've shown good judgment about shipping as fast as possible while ensuring your products and platforms are built in a sustainable, responsible way-and you're comfortable making mistakes, provided you learn from them.</li><li>\nPassion and energy. Because you love what you do, you bring an infectious passion to all your endeavors. You always perform at your absolute best and see new challenges as an opportunity to contribute, make an impact, and grow.</li><li>\nUnquenchable thirst for growth. You're not just looking for the next exciting challenge, but looking to push yourself to keep pace in our hyper-growth environment.</li></ul>",
    "job_title": "Front End Web Engineer"
  },
  {
    "description_text": "<p>For over 20 years we have connected people with their passions, products with engaged customers, and our multi-channel clients—including some of the world’s largest consumer brands—with innovative marketing programs.\n</p>\n<p>We believe great technology empowers organizations. At Synapse, we're using technology to reinvent subscription and consumer relationships, and building creative products that impact millions of people.\n</p>",
    "requirement_text": "<ul><li>You have a minimum of 2 years of hands-on front-end software development experience building customer facing websites\n</li><li>You have worked with high performing engineering teams, including both onshore and offshore, to solve tough problems\n</li><li>You communicate clearly and effectively with technical and non-technical audiences\n</li><li>You care deeply about customers, architecture, design, UI/UX and quality\n</li><li>You have experience creating websites from ground up using responsive and adaptive designs with modern web architectures and methodologies\n</li><li>You are able to create or take wireframes and produce high quality user interfaces\n</li><li>You have deep understanding of most of these technologies and are eager to learn the rest quickly – JavaScript, TypeScript, HTML, CSS, React, Redux, Node, UI/UX design and best practices, object-oriented programming, front-end build tools such as Webpack, TDD/BDD tools such as Cucumber or JUnit, browser testing tools such as Selenium, GitHub, SQL is a plus\n</li><li>Experience producing technical and design documentation of complex processes is a plus\n</li><li>You have previous experience delivering products in an Agile environment (Scrum / Kanban) or are interested in learning\n</li><li>B.S. in Computer Science (or equivalent degree or work experience)\n</li></ul>",
    "job_title": "Front-end Software Engineer"
  }
]