[{
        "description_text": "<div><p>Piper Companies is currently seeking a Full Stack Developer for a remote opportunity with a rapidly growing company headquartered in Foster City, California(CA). The Full Stack Developer will be responsible for developing front end web architecture as well as developing back end web applications.<br> </p><p></p><br> <p><b>Responsibilities of the Full Stack Developer:</b></p><ul><li> Developing front end architecture</li><li> Developing back end applications</li><li> Write effective API’s</li><li> Troubleshoot, debug and upgrade software.</li></ul><p></p><br> </div>",
        "requirement_text": "<ul><li> 5+ years of RoR experience</li><li> 5+ years of Ember or Vue experience</li><li> Experience in API Development</li><li> Experience with Amazon Web Services and Continuous Integration</li><li> Experience with relational databases</li></ul>",
        "job_title": "Full Stack Developer"
    },
    {
        "description_text": "<div><p><b>About Us:</b></p> <p> Dimagi was born from the belief that there's a better way to provide services to those in need. Our mission is to create digital products that support global development efforts and help accelerate the end of extreme poverty. CommCare, our mobile data collection platform, is designed to improve data collection and the quality of frontline services in low-resource settings around the world. We work across various sectors with organizations of all sizes providing mobile solutions that put end-users first. Working with partners that include the Bill &amp; Melinda Gates Foundation, USAID, CARE International, and the World Bank, Dimagi has successfully implemented CommCare and supported 2,000 projects across 80 countries. Dimagi is a certified Benefit Corporation and leading social enterprise, working since 2002 towards our commitment to making an impact.</p> <p><b> Location</b>: Cambridge, MA or Remote within the United States or Canada (<b>Must be eligible to work in the country you are based in.</b>)</p> <p><b> About the position:</b></p> <p> Our Global technology team helps to develop and improve our platform's architecture design for expressing end-to-end system workflows, both at the functional level and the technical level. Since CommCare is used for applications related to many different types of problems, from agricultural extension education to improving delivery outcomes at birth, the software is written as a portable application engine. That means we don't often build custom code for specific projects.</p> <p> Dimagi is looking for a <b>Junior Full Stack Developer</b> to join our Global Technology team. This position will be based out of our <b>Cambridge office</b> but is also open to <b>remote employment within the United States and Canada</b>. This role is a<b> 12-month fixed-term position </b>with the option for converting to a permanent status pending re-evaluation of requirements at the end of the contract.</p> <p> This position is ideal for someone who enjoys small organizations, multi-tasking, and a highly flexible work environment. Our developers share a passion for making things work in challenging situations and seeing the impact of our work first-hand.</p> </div>",
        "requirement_text": "<ul> <li>Comfortable developing enterprise-quality software in a high-level language such as Python or Ruby</li> <li>Background in building software for the web</li> <li>Fluency in written and spoken English</li> <li>Ability to quickly learn development technologies (Python, Django, Postgres, CouchDB, Elasticsearch, Javascript, and HTML)</li> <li>Excellent verbal and written communication skills</li> <li>Strong analytical skills and desire to write clean, correct, and efficient code</li> </ul>",
        "job_title": "Junior Full Stack Developer"
    },
    {
        "description_text": "<div><div><div><div><div><p>We are recruiting an experienced full stack web developer to join our application development team. We are committed to delivering a top quality web experience and workflow, and need a passionate professional to continue refining the vision and make it a reality. We expect the candidate will take the current vision and make it his/her own, and truly own the end-user experience on the web. Security is a primary requirement along with high quality design and ease of use for the end-users.</p></div></div></div></div><p></p><div><div></div><p></p><div><div><div><p><b> Core Duties:</b></p><ul><li> Design and build a secure, compelling, end-user workflow and experience</li><li> Evaluate and select the core technologies needed to deliver a secure, responsive, intuitive application</li><li> Work closely with our front-end team to develop the necessary services, APIs, etc. to successfully drive the web experience</li><li> Constantly evolve and improve our end-user interface</li><li> Deliver a consistent, reliable, performant, external API</li><li> Work with an agile team to solve problems and deliver results</li></ul><p><b> Detailed responsibilities:</b></p><ul><li> Lead the technology selection and application architecture as appropriate for new applications</li><li> Work closely with the front-end engineering team to ensure coordinated APIs are developed</li><li> Full stack web application development using proven technology stack</li><li> Full cycle of back-end UI development. Includes deep understanding of the NodeJS, ExpressJS, object-oriented JavaScript, and common JavaScript libraries</li><li> Evaluating and utilizing frameworks for front end development, such as Angular, React, Vue</li><li> Maintaining complex JavaScript/Typescript back-end projects. This includes the ability to structure JavaScript code, delay loading, long running operation support, and execution optimization</li><li> Manage the optimization, and bundling of our framework/libraries using tools like Backpack, NodeJS scripts</li><li> Maintaining and extending the projects testing suite, both Unit and Integration tests</li></ul></div></div></div></div></div>",
        "requirement_text": "<ul><li> Expertise in NodeJS, ExpressJS, the Express Middleware pattern</li><li> Experience with NoSQL Database Adapters like mongoose, elasticsearchjs, etc. </li><li>Experience building Resource Oriented HTTP REST APIs</li><li> Expertise in REST/JSON/AJAX</li><li> Experience with agile development and version control systems</li><li> Excellent debugging and problem solving skills</li><li> Excellent communication skills and the ability to operate independently as part of a distributed team</li></ul>",
        "job_title": "full stack web developer"
    },
    {
        "description_text": "<div><p>UFG offers you an award-winning workplace and a trustworthy, financially stable company. While we’ve always known our commitment to employees and financial stewardship, it is good to have others recognize our dedicated efforts. We've been named an Iowa Top Workplace by the <i>Des Moines Register </i>for four consecutive years and included on <i>Forbes'</i> America's Trustworthy Financial Companies every year since 2014. Additionally, UFG is a super-regional property and casualty insurer rated A (Excellent) by A.M. Best Company.</p><p> UFG is looking for an <b>Application Developer</b> to join our team. This position requires a critical thinker with strong technical skills who can thrive in a constantly changing environment. The successful applicant will play a critical role in the review, design, development, and modification of applications as well as integrations between existing and newly purchased systems. This is a great opportunity to work for a stable company that values its employees and has great benefits.</p><p><b> Responsibilities</b>:</p><ul><li> Develop and maintain applications that meet defined requirements and business specifications.</li><li> Consult with project managers, team members and users to evaluate business needs.</li><li> Effectively communicate the advantages and constraints of the application environment and recommend appropriate solutions that will meet or exceed the expectations of the end user and business users.</li><li> Design, develop and test code that performs efficiently and meets or exceeds performance standards.</li><li> Keep current in new technologies and technical aptitude.</li></ul></div>",
        "requirement_text": "<ul><li> Degree in Computer Science or equivalent work experience.</li><li> Minimum of seven years of relevant work experience.</li><li> Proficiency with .Net framework, C#, modern front end technologies, REST and SOAP, MS SQL Server.</li><li> Experience with Mulesoft and Java is a plus.</li><li> Experience with Git/GitHub/pull request workflow.</li><li> Experience with continuous integration environments.</li><li> Knowledge automated testing, both front end and backend.</li><li> Willingness to work on both new product development and legacy support.</li><li> Comfortable collaborating with teams based in multiple locations and mentoring junior team members.</li><li> Outstanding written and verbal communication skills; ability to describe complex, highly technical issues using simple, clear, and precise language.</li><li> Fast learner with a desire to grow your skill set on a continual basis.</li><li> Experience with insurance industry and common insurance software suites is a plus, but not required.</li></ul>",
        "job_title": "Application Developer - Full Stack"
    },
    {
        "description_text": "<div>Overview: <div> Upwork has partnered with an American worldwide employment-related search engine. They strive to put job seekers first, giving them free access to search for jobs, post resumes, and research companies. To continue with this mission, they are seeking to add a Full Stack Developer to their team to help them design a communications targeting system. </div>Responsibilities: <ul><li>Working with development teams and product managers to ideate software solutions. Designing client-side and server-side architecture.</li><li> Building the front-end of applications through appealing visual design.</li><li> Developing and managing well-functioning databases and applications. Writing effective APIs.</li><li> Testing software to ensure responsiveness and efficiency.</li><li> Troubleshooting, debugging and upgrading software</li><li> Creating security and data protection settings</li><li> Building features and applications with a mobile responsive design</li><li> Writing technical documentation</li><li> Working with data scientists and analysts to improve software </li></ul></div>",
        "requirement_text": "<ul><li>3+ years of experience as a Full Stack Developer or similar role</li><li> Experience developing desktop applications</li><li> 3+ years of experience working with multiple front-end languages and libraries (e.g. HTML/ CSS, JavaScript)</li><li> Advanced Knowledge of multiple back-end languages (Java, Python) and JavaScript frameworks (e.g. React)</li><li> Advanced knowledge of SQL and Presto</li><li> You possess light data engineering experience </li></ul>",
        "job_title": "Full Stack Developer"
    },
    {
        "description_text": "<div><div><div><b>Who we are:</b></div><div> Loadsmart aims to move more with less. We combine great people and innovative technology to more efficiently move freight throughout North America. Our focus is on designing and building the best tools for our team and our customers, using machine learning algorithms to connect cargo with trucks. By better matching supply and demand, we reduce wasted fuel and lost time, cutting out empty miles for motor carriers and providing instant booking for shippers.</div><div></div><br> <div><b> Who you are:</b></div><div> You are curious to impact a 700 billion dollar industry of logistics. You are a first-rate software engineer, with experience building products from the browser to the database. You are passionate about developing and you value quality and code maintainability. You like working in a hands-on environment and enjoy teamwork. You are pragmatic and do not pick technologies without considering the benefits for the product and business. You are a thinker and problem solver, not a requirement follower.</div><div></div><br> <div><b> The role:</b></div><div> We are looking for a Fullstack Engineer to work remotely. You'll join us in obsessing about transformational technology as part of our Load Operations Squad Group. You should have experience building software from the browser to the database. Our technology stack is based on React for the frontend and Python/Django for the backend.</div><div></div><br> <div><b> The squad:</b></div><div> We are a growing team of passionate engineers, designers and product managers from all levels. Our mission is to establish a new benchmark for operational efficiency. We have a collaborative work environment, where engineers and other team members from different departments pool their knowledge together to help each other to grow. We value interaction and collaboration more than just coding.</div></div><div></div><br> <div><div><div><ul><li> Together with other team members, be responsible for the whole lifecycle of our products and features, from the conception, specification, development, testing, and maintenance.</li><li> Build modern, efficient, modular, and tested user interfaces using React.</li><li> Build scalable backend solutions using Python and Django.</li><li> Discuss good practices for software development and feel comfortable suggesting contributions to build our set of internal guidelines and shared code.</li><li> Review Pull Requests from the other members of the team.</li></ul></div></div></div> </div>",
        "requirement_text": "<ul><li> Communication. You’re very comfortable communicating in English (both written and spoken) - you will work in an international team with native and non-native English speakers.</li><li> Teamwork. You like to work as a team more than solve problems by yourself.</li><li> Frontend. 2+ years of experience with UI development, having in-depth knowledge about Javascript, HTML5, and CSS. React is a plus.</li><li> Backend. Experience building backend solutions in any language. Interest in working with Python.</li><li> Passion. Be passionate about creating clean, highly maintainable, and structured code, supported by unit and integration tests.</li><li> Troubleshooting. You're good at identifying the source of bugs, know how to dig into the code that may be causing the outstanding issue, and work to resolve any issues that come up</li><li> Curiosity. You're keen on learning new technologies and tools as well as evaluating their pros and cons. You're a pragmatic programmer. You ask questions and are eager to learn more.</li><li> Bachelor's degree in Computer Science or in a related field is preferable but not mandatory.</li></ul>",
        "job_title": "Full Stack Engineer (Remote-LATAM)"
    },
    {
        "description_text": "<div>As a member of our Software Engineering Group we look first and foremost for people who are passionate around solving business problems through innovation &amp; engineering practices. You will be required to apply your depth of knowledge and expertise to all aspects of the software development lifecycle, as well as partner continuously with your many stakeholders on a daily basis to stay focused on common goals. We embrace a culture of experimentation and constantly strive for improvement and learning. You'll work in a collaborative, trusting, thought-provoking environment-one that encourages diversity of thought and creative solutions that are in the best interests of our customers globally.</div>",
        "requirement_text": "<ul><li>Must be comfortable with and eager to perform tasks in all phases of software lifecycle (i.e., requirements analysis, design, development, test, and deploy) </li><li>Ability to convey ideas concisely in team environment</li> <li>Ability to work effectively as a team player in Scrum environment </li><li>Ability to analyze complex domain models</li> <li>Experience working within the principles of the Agile Methodology </li><li>Superior written and oral communication skills</li> <li>Strong analytical and problem-solving skills</li> <li>Penchant for working proactively to identify coding issues and solve problems for business stakeholders</li> <li>7 plus years of Object-Oriented design experience </li><li>7 plus years Java development experience </li><li>5 plus years of relational database software development experience (Oracle, SQL Server) </li><li>3 plus years of web-based User Interface development (Javascript, Typescript, AngularJS, Angular 2+, React, jQuery, JSON) </li><li>2-3 years of Spring Boot microservices experience</li> <li>Familiarity with GraphQL a plus</li> <li>Familiarity with Cloud development a plus (e.g., Pivotal Cloud Foundry, AWS, Docker and Kubernetes)</li> </ul>",
        "job_title": "Full Stack Software Engineer"
    },
    {
        "description_text": "<div><div>We believe that the way consumers and businesses interact with their finances will drastically improve in the next few years. Our goal is to build the tools and infrastructure for developers to create this next generation of financial services applications. Today, thousands of companies such as Acorns, Stripe, and Venmo rely on Plaid to integrate with banks and the financial system. And thousands of developers rely on Plaid’s Learning Platform (https://www.plaid.com/docs) and Developer Relations team to discover Plaid functionality and understand how - and why - to build with Plaid.</div><div></div><br> <div> We're looking for a Full-Stack Engineer to help us ensure that the next generations of fintechs are built on Plaid. Our engineering culture is IC-driven—we favor bottom-up ideation and empowerment of our team. As a result we are looking for engineers who are excited by leading projects through setting technical and product direction and mentoring those around them. We are looking for engineers who are motivated by creating impact for our consumers and customers, growing together as a team, shipping the MVP, and leaving things better than we found them.</div><div></div><br> <div> We're guided by our principles including impact, growing together, embracing openness and positivity, inventing tomorrow; we’re looking for leaders who are motivated by those same principles.</div></div>",
        "requirement_text": "<div><ul><li> A strong sense of ownershipExperience building web applications</li><li> Experience with JavaScript, HTML, CSS, browsers, stylesheets, and mobile devices</li><li> Experience with full-stack development, including building server-side components (Python, Go, PHP, or Java)</li><li> Developer empathy and product sense</li><li> Background in computer science, engineering, or another related field</li></ul></div>",
        "job_title": "Software Engineer - Full Stack (Developer Relations)"
    },
    {
        "description_text": "<div><div><b>About OutSystems</b></div> <div><br> OutSystems R&amp;D is known for working on highly complex problems while focusing on keeping the product extremely easy to use, allowing us to lead the future of software development. <b>We expect our engineers to help us drive the software development landscape changes by disrupting the way modern software is built.</b><br> <br> The OutSystems engineering team has developed its own visual coding language, compilers to transform it into optimized high code, smart assistant AI mechanisms to accelerate development (TrueChange), code flow optimization mechanisms, and additional PaaS services that allow customers to easily develop powerful applications. The team empowers customers to tame all the hassles of complex software development under a powerful yet simple-to-use platform.<br> <br> To apply to this position, you need to be willing to build a product used across the globe by some of the largest and most complex organizations, like Toyota, Salsa Jeans, ThinkMoney, Logitech, and others. You’ll build a product that will be used by developers of any industry, enabling the development of software used by millions of end-users across the globe, with auto-scaling capabilities. The product also allows customers to build very complex core systems that deal with complex business logic and integrations with legacy systems based on product extensibility SDKs.<br> <br> <b>Full-Stack Engineer at OutSystems</b><br> We are looking for Full-Stack engineers who know how to build high performant web-based applications to help improve our platform to take away all the complexity of application development from our customers. OutSystems mission is to make software development available to everyone, so you can expect big challenges ahead.<br> <br> As a Full-Stack, we expect you to work with your team in designing and developing features that will be used by the OutSystems developers all over the world. You will be able to work end-to-end in our platform, from the developer experience provided in our IDE to the runtime representation of each feature.<br> <br> We also expect you to innovate and bring development best practices into your team while you keep looking at the upcoming technologies and frameworks.<br> <br> </div> </div>",
        "requirement_text": "<div> <ul><li>Bachelor’s or Master's Degree in Software Engineering, Computer Science, or similar. If you do not have one but you have a solid understanding of computer science and software engineering fundamentals, we still want to hear from you;</li> </ul> <div></div><ul><li>More than 4 years of JavaScript and C# experience or equivalent;</li> </ul> <div></div><ul><li>Solid understanding of web architectures;</li> </ul> <div></div><ul><li>Experience with testing frameworks and methodologies;</li> </ul> <div></div><ul><li>Experience with React or TypeScript is a plus;</li> </ul> <div></div><ul><li>Passion to analyze and design elegant solutions for high-tech problems;</li> </ul> <div></div><ul><li>Experience in mentoring more junior software engineers;</li> </ul> <div></div><ul><li>Drive to innovate and bring development best practices into your team;</li> </ul> <div></div><ul><li>Drive to understand what are the upcoming technologies and frameworks;</li> </ul> <div></div><ul><li>Good communication skills and fluency in English.</li> </ul> <ul><li>A world-class software engineering team with peers and leaders that are inspired to learn and share what they know;</li> </ul> <div></div><ul><li>A fast-growing company that provides many opportunities for you to grow;</li> </ul> <div></div><ul><li>Fun from day one: a relaxed work environment, colleagues from diverse backgrounds and with a diverse range of interests, fun company events;</li> </ul> <div></div></div>",
        "job_title": "Full-Stack Software Engineer"
    },
    {
        "description_text": "<div><div><div><b><i>ECI is seeking </i></b><b><i>a Full Stack Web </i></b><b><i>Developer to continue to provide the best in customer software to small and medium sized businesses</i></b> </div><div></div><div>Our company is growing and creating excitement with our best in class ERP products.<br> </div><div>Our software engineering team is rapidly growing and looking for a <b>Full Stack Web Developer </b>to be part of a fast paced, high-energy team. Our engineers are serious about the success of the company and driving revolutionary changes with our products. If you are an experienced engineer with a passion for technology and solving complex business problems and believe planning, hard work, teamwork and quality is what it takes to succeed, then this is the job for you. </div><div></div><div><b>Key Responsibilities</b>: </div><ul><li><div>Work with customers, technical architects, and consultants to understand value and define the requirements for our field service business applications. </div></li><li><div>Communicate effectively with the team to gather requirements and create understanding through development process. </div></li><li><div>Develop strategies with other engineering teams across ECI. </div></li><li><div>Develop and maintain front and back end code for LAMP application. </div></li><li><div>Resolve bugs in existing application code. </div></li><li><div>Design and execute SQL database schema changes. </div></li><li><div>Provide support for application as needed. </div></li><li><div>Make changes to server configuration as needed. </div></li></ul><div></div><div><b>Requirements</b> </div><ul><li><div>4-year degree in Computer Science, Software Engineering, or similar, or equivalent work experience. </div></li><li><div>2+ years working with an object-oriented programming language (PHP, Java, C#, or similar). PHP Strongly preferred. </div></li><li><div>Ability to communicate and interface with technical and non-technical members of the organization. </div></li><li><div>Ability to write clean and commented code. </div></li><li><div>Strong knowledge of HTML, CSS, JavaScript, jQuery, and AJAX. </div></li><li><div>Ability to create and debug complex SQL queries and design logical data models and enterprise DB database structures. </div></li><li><div>Experience integrating with backend REST/SOAP APIs. </div></li><li><div>Knowledge regarding parsing JSON and XML. </div></li><li><div>Experience with horizontal scaling and working with web-based SaaS applications. </div></li><li><div>Experience using version control system (Git, Mercurial, SVN, or similar). </div></li><li><div>Familiar with common security and performance practices. </div></li><li><div>Design UI Interaction, workflow, and elements based on existing UI. </div></li><li><div>Familiar with continuous integration and deployment concepts. </div></li><li><div>Basic experience and understanding of Linux operating systems (CentOS, Debian, etc). </div></li><li><div>Experience working with Apache or Nginx. </div></li></ul></div></div>",
        "requirement_text": "<ul><li><div>4-year degree in Computer Science, Software Engineering, or similar, or equivalent work experience. </div></li><li><div>2+ years working with an object-oriented programming language (PHP, Java, C#, or similar). PHP Strongly preferred. </div></li><li><div>Ability to communicate and interface with technical and non-technical members of the organization. </div></li><li><div>Ability to write clean and commented code. </div></li><li><div>Strong knowledge of HTML, CSS, JavaScript, jQuery, and AJAX. </div></li><li><div>Ability to create and debug complex SQL queries and design logical data models and enterprise DB database structures. </div></li><li><div>Experience integrating with backend REST/SOAP APIs. </div></li><li><div>Knowledge regarding parsing JSON and XML. </div></li><li><div>Experience with horizontal scaling and working with web-based SaaS applications. </div></li><li><div>Experience using version control system (Git, Mercurial, SVN, or similar). </div></li><li><div>Familiar with common security and performance practices. </div></li><li><div>Design UI Interaction, workflow, and elements based on existing UI. </div></li><li><div>Familiar with continuous integration and deployment concepts. </div></li><li><div>Basic experience and understanding of Linux operating systems (CentOS, Debian, etc). </div></li><li><div>Experience working with Apache or Nginx. </div></li></ul>",
        "job_title": "Full-Stack Web Developer"
    },
    {
        "description_text": "<ul><li> Own your work from technical design, development, testing, deploying, maintaining and documenting</li><li> Collaborate with the Product team and other members of the Engineering team to solve business &amp; technical challenges in simple, sustainable ways</li></ul>",
        "requirement_text": "<ul><li> 2+ years professional, full-time experience in a full-stack developer role</li><li> Solid experience with NodeJS</li><li> Exceptional work ethic, critical thinking skills &amp; attention to detail</li><li> Ability to work both collaboratively, and autonomously, within a distributed Engineering team</li><li> Bonus if you have familiarity with any of the following:<ul><li> React/Redux, RabbitMQ, JSON API, Nginx, Supervisord, MySQL, Couchbase, Docker</li><li> Authentication mechanisms such as OAuth, JWT, etc.</li><li> Browser automation &amp; web scraping</li><li> AWS, distributed systems &amp; networking</li></ul></li></ul>",
        "job_title": "Junior Full-Stack Developer"
    },
    {
        "description_text": "<div> <p> We all know the stereotype of the creative writer. Barista / Uber driver by day but working on scripts by night. Working for years in isolation with no feedback, networking to find agents/influencers, and praying that a publisher will find an audience.</p> <p> Tales is a platform that allows writers (TellTale, BioWare, Ubisoft, EA, Blizzard, PocketGems, Nexon, Choice of Games, Episode, etc) to rapidly pilot episodic stories and iterate off feedback/metrics to improve performance. They can easily add visuals, choices, and persistence. Couple all this with freemium monetization and we’ve got stories that can be produced for less than the cost of an eBook but with the distribution potential of free-to-play mobile games.</p> <p> Success shouldn’t be dictated by who you know: good stories should rise to the top through talented storytellers… coupled with user data, iteration, modern formats, and effective monetization. Join us and together we’ll build the platform for episodic and interactive fiction!</p> <p> Specialization is for insects, developers at Tales will do a little bit of everything. We expect you to have shipped mobile apps and touched a large variety of systems. We’re not looking for someone to mentor; we’re looking for leaders who can clear the way for their colleagues. Handled server-side scaling challenges? Check. Responsive web clients? Piece of cake. Tools that empower the team? You’ve lost track of how many things you’ve built to help others or yourself save time.</p> <ul><li><b>Publishing</b>: Develop systems to allow writers to publish, collect insights, improve monetization, and reduce friction for organic distribution.</li> <li><b>Content Authoring Tools</b>: Tools to add visuals, interactivity, and persistence to stories for professional writers.</li> <li><b>Game Client</b>: Improvements to make the consumer experience more delightful.</li> </ul> </div>",
        "requirement_text": "<ul><li>3+ years software development experience with at least 1 working with Unity3D</li> <li>Experience shipping or iterating on live web/mobile apps</li> <li>Proficiency with Javascript, C#/.NET, and Python</li> <li>Experience with Git, Amazon AWS, and WordPress</li> <li>B.S. in Computer Science, or equivalent experience</li> </ul>",
        "job_title": "Full-Stack Developer"
    },
    {
        "description_text": "<div><div><p>This role is responsible for developing core features for our existing SAAS software solution. This will involve understanding business requirements, translating them into technical specifications, and then implementing them in software. This core feature development role will involve working in many aspects of application development including design and implementation of database schema, entity and relational models, web services, and rich frontend user experiences</p> <p> Our software solution is designed as a single page web application written in React and Typescript. Our backend consists primarily of ASP.Net Core with some Node.JS. We use PostgreSQL, Elasticsearch, and Redis for persistence. Additionally, we take full advantage of containers and orchestration with Docker and Kubernetes, and we make use of the Apache Kafka streaming platform. Any experience with these technologies is a plus.</p> </div> <div><ul><li>Ability to design and develop application features</li> <li>Review and repair code</li> <li>Provide recommendations for improvement and efficiency of productivity</li> <li>Identify and utilize new and emerging technologies to define comprehensive, sustainable, extensible architecture to meet defined business needs.</li> <li>Partner with other internal teams and peers in the department to ensure solutions meet the holistic needs of our customers.</li> <li>Supports Innovation; regularly provides new ideas to help people, process, and technology that interact with our product ecosystem.</li> <li>Supports a clear communication strategy that keeps all relevant stakeholders informed and provides an opportunity to influence the direction of the work</li> </ul> </div></div>",
        "requirement_text": "<div> <ul><li>3+ Years of experience as a Full-Stack Engineer (1 year React experience is helpful)</li> <li>Experience with relational database technologies and SQL</li> <li>Experience with object-oriented software development principles</li> <li>Self-driven, motivated and results-oriented</li> <li>Excited to learn and grow as a professional software engineer</li> <li>An effective communicator and work well as part of a team</li> <li>Willing to “step up” and take on responsibility for being our in-house expert for new and existing core features</li> </ul> <ul><li>Experience in architecting/designing software products to drive data &amp; analytic efforts</li> <li>Understanding of security risks and vulnerabilities, leveraging tools and techniques to minimize risk.</li> <li>Ability to communicate and present advanced technical topics to general audiences.</li> <li>Automation, Configuration Management, Dev-ops practices</li> <li>Experience/Knowledge of building applications using high-security Public/Private cloud infrastructure</li> </ul> </div>",
        "job_title": "Full Stack Engineer"
    },
    {
        "description_text": "<div><p><b>Explore solutions that deliver innovation </b></p><p><b>Accuity </b>powers compliant and assured client transactions to help build an interconnected, vibrant financial ecosystem. Through data and analytics that spans financial crime screening, payment services, and benefits compliance, we create unmatched confidence and efficiency for our clients to enable financial inclusion while identifying illicit financial activity and fraudulent players. If you share our values, take the opportunity to think big, aim high, and explore more. </p><p></p><p><b>Accuity </b>is seeking a <b>Software Engineer III </b>to design and develop our Data, API and Web solutions. As a member of the team this individual should be experienced in software design, development, testing, deployment, instrumentation, and support. The Software Engineer III will be a critical part in not only developing our solutions but also ensuring our technology platform remains modern and responsive to the changing technology ecosystem. </p><p></p><div><b>KEY RESPONSIBILITIES </b><br> <ul><li>Implement coding and SDLC best practices, and assist others through code and design reviews. </li><li>Operate in an Agile development environment while collaborating with key stakeholders. </li><li>Contribute to User Story writing and reviews to ensure software design tasks are accurately captured. </li><li>Resolve technical issues as necessary, including security vulnerabilities. </li><li>Keep abreast of new technology developments. </li></ul><br> <b>QUALIFICATIONS: </b></div></div>",
        "requirement_text": "<div><ul><li>3+ years of Software Engineering experience in <b>Java </b>environment </li><li>Degree in Computer Science or equivalent professional experience </li><li>Knowledge of professional software engineering practices for the full software development life cycle including coding standards, code reviews, source control management, build processes, automated testing, and DevOps </li><li>Experience with designing, building and deploying scalable, highly available systems </li><li>Experience with Linux and cloud hosting </li><li>Experience working with Relational and NoSQL Databases<br> </li></ul><div> <ul><li>Expertise with Java/J2EE/Spring and Restful Webservices </li><li>Experience developing single page webapps using frameworks including or similar to Angular JS and React </li><li>Experience working with large Relational and NoSQL databases </li><li>Good knowledge of XML and JSON data formats </li><li>Knowledge in developing with applicable tool sets, including or similar to: Git, Groovy, Gradle, Jenkins, IntelliJ </li><li>Knowledge of test-driven development </li><li>Familiarity with Amazon cloud-based services and the Linux operating system </li></ul></div></div>",
        "job_title": "Full-Stack Software Engineer"
    },
    {
        "description_text": "<div><div><div> </div><p>Oracle Utilities software powers the utilities that serve millions of people around the world. Our software-as-a-service applications are applying cutting edge data analytics and behavioral insights to help customers understand and take control of their utility usage. We're looking to hire a full-stack software engineer to join our team in Pleasanton, CA. Remote work is also available for this position.</p><br> <p></p> <p><b>About the Project</b></p> <p>Oracle Utilities' Digital Self Service is a new cloud-based web application for utility customers to manage their accounts; from start/stop service, bill pay, providing insights about usage and billing, and giving energy saving tips. Digital Self Service is the one SaaS web application that a utility needs to serve its customers. The focus is on building UX with client-side JavaScript web frameworks (React, Redux) and Java RESTful API services. You will also collaborate with SOA frameworks, build &amp; operate micro-services, and work with big-data sets, amongst other cool tech. We use agile practices, work in 3 weeks sprints, rely heavily on continuous integration, automated testing and development and deployment best practices.</p><br> <p></p> <p><b>About you</b></p> <ul><li>You’re excited about problem solving and programming with experience in one or more higher level languages: Java, Python, JavaScript. </li><li>You're experienced with a modern service-based web stack: JavaScript client-side apps, Java REST API services, databases. As a bonus, you've picked up deeper knowledge on things like caching, HTTP protocol, TCP/IP, Linux, etc.</li> <li>You are passionate about JavaScript tools and frameworks (Angular and/or React preferred) and the future of JavaScript because of projects like Node, npm, Grunt, Gulp, Browserify, etc.</li> <li>You're equally motivated to learn from others and be a mentor to junior team members.</li></ul><br> <p> </p> </div><div></div></div>",
        "requirement_text": "<ul><li>Experience building RESTful web services using Java or another higher level programming language.</li> <li>Experience building web apps with JavaScript framework such as React or AngularJS.</li> <li>Experience with Mocha, Karma, Jasmine, Protractor, or another unit testing framework.</li> <li>Solid understanding of JavaScript prototypes, callbacks, promises, performance issues.</li> </ul>",
        "job_title": "Full Stack Developer"
    }
]