[
    {
        "description_text": "Applicant should have 2-3 years of experience on iOS & strong background in Objective C\nShould have published at least 5 mobile apps\nDeveloper will work on iOS App Development Project on day to day basis\nHands on experience of Xcode, Objective C, JSON & Sqlite on iOS platform\nKnowledge of database, SDLC & Oops Concepts\nKnowledge on HTML5, JQuery, CSS3, Java Script, Ajax\nDevelop Native& Hybrid mobile applications\nImplementing Mobile Payments, Mobile Shopping & Security",
        "requirement_text": "Proficient in Objective C, iOS, X-Code etc.\nHaving good knowledge of iOS SDK & interface builders\nContinuously updating the expertise on latest releases of iOS products\nShould have developed at least 5 applications as per Apple standards\nExperience with Database in Mobile Apps like SQlite & Core Data.\nExperience in integrating Webservices like SOAP, REST and POST with Mobile App.\nExperience with Google Map & GPS Integration",
        "job_title": "iOS Developer"
    },
    {
        "description_text": "Two Barrels is hiring a iOS App Developer for $110,000/year. You will be a traditional company employee. This is a full time 40 hour/week position with company benefits.\nTwo Barrels is hiring a mobile application development expert to join our engineering team to focus on front-end mobile app development. We’ve got some great ideas for where our technology can go next, but we need to add some mobile developers to make that happen.",
        "requirement_text": "BS in Computer Science or four years of related experience\n4+ years experience with designing, building, and maintaining complex mobile apps\nPublished at least 1 original iOS app\nProven experience of the full iOS development life cycle\nExperience working with iOS frameworks such as Core Data, Core Animation, Core Graphics and Core Text\nExperience working with remote data via\nKnowledge of general mobile landscape including architecture, trends, & emerging technologies\nExperience with mobile app testing & security\nYou're pleasant person to work with\nPreferred Qualifications:\nAble to work in an agile environment with a focus on continuous integration\nFull stack development experience\nYou're not a jerk, you might be quirky, socially awkward, or just take a year to come out of your shell",
        "job_title": "iOS App Developer"
    },
    {
        "description_text": "Collaborate as part of a team to develop requirements and interfaces.\nThe primary function of this contract is to develop the Mobile Application software.\nPerform Mobile Application software architecture and design activities and communicate to clients and internal team members by authoring design documentation and through verbal communication.\nPartnered with an internal Project Manager, you will plan project tasks and contribute to ensure projects are completed on time and within expected scope and budget, with a high level of customer satisfaction and attention to quality.\nExecute with minimal guidance and strong initiative in a fast-paced environment.",
        "requirement_text": "Expert understanding of Mobile Application object-oriented design principles and software development best practices.\nExpert understanding of development of software for the mobile device as Bluetooth LE Central.\nStrong hands-on technical abilities in programming, debugging and troubleshooting.\nExtremely strong written and verbal communication skills. Communication skills are important as you will be interacting directly with clients.\nSoftware project estimation techniques.\nExperience using Azure DevOps, Jira or equivalent.",
        "job_title": "iOS / Android Mobile Application Developer - Contract"
    },
    {
        "description_text": "Fox News is seeking an iOS Developer to assist with maintaining the Fox News and Fox Business mobile and OTT apps. We're looking for someone who is proficient at coding in Swift and adheres to best practices to ensure the delivery of stable and reliable app releases. You will have the opportunity to solve challenging technical problems and maintain good communication with other developers and stakeholders. In addition to programming, you will assist with maintaining CI/CD workflows, improving testing solutions, and optimizing the overall development process.",
        "requirement_text": "3+ years of experience in iOS Development using Swift\nExperience with CocoaPods\nExperience with RESTful JSON feed consumption        \nExperience with push notification integration and deep linking\nExperience with Git, GitHub and Gitflow\nExperience with the latest development paradigms regarding performance, security and coding best practices\nStrong knowledge of design patterns\nFamiliarity with MVVM and Coordinators\nGood communication skills with different stakeholders such as QA, Project Managers and Product Owners",
        "job_title": "iOS Developer"
    },
    {
        "description_text": "Role:\nWe’re looking for an iOS Developer to join our core founding team. As a key member of the team, you’ll build out our technology platform, have an influence on our product strategy by helping define the product features, refine system architecture, and spearhead best practices that enable a high-quality product. A commitment to teamwork, hustle, and strong communication skills are absolute requirements.\nThis is the opportunity to be part of a fast-paced, small, and flat organization responsible for developing a massive consumer product. If you love sports and are looking for an opportunity to directly see your work impact the business, this could be the role for you!\nWhat you’ll do:        \nWork directly with the founders to execute the vision of the company\nCollaborate with mobile front-end and back-end engineers to build new features and fix bugs\nDesign the architecture of the platform and find the balance between speed and scalability\nBe involved in all facets of a fast-growing technology startup including operations, business development and design.\nWrite automated tests for the platform",
        "requirement_text": "3+ years of professional mobile software development experience\nAn exceptional skilled and hungry engineer and problem solver\nExcellent written and verbal communication\nYou can understand and articulate the design and architecture of the entire system.\nYou are eager to work openly and collaboratively with a diverse team\nYou feel comfortable working in a tech-driven environment with the ability to coordinate across several stakeholder groups (Engineering, Operations, Marketing, HR, etc.)\nProactive self-starter\nYou are driven to learn new technologies\nPassion for sports is a huge plus",
        "job_title": "iOS Developer"
    },
    {
        "description_text": "User-centric development of high-quality code that is maintainable and testable\nCollaborate with design, product, and engineering to deliver great user experiences\nBe part of the core team developing new app features\nImproving our existing code base",
        "requirement_text": "2+ years of industry experience\nExperience shipping one or more Swift or Obj-C iOS app(s)\nAbility to write clean, well factored UI code\nAble to not only create extensible and reusable software, but highly capable of being able to refactor existing code\nExperience with asynchronous programming\nPassionate about creating and refining great mobile user experiences\nMust be a self-starter with the ability to learn new systems\nExcellent verbal and written communication\nStrong interpersonal skills\nAbility to work in a fast-paced environment with frequent software releases\nA willingness to take ownership of projects and drive them to completion",
        "job_title": "iOS Mobile App Developer"
    },
    {
        "description_text": "As a native iOS Engineer at SyscoLabs, you will work on apps that revolutionize customer interaction at Sysco. You will have a passion for code-quality and expertise in security, usability, and mobile standards. You will be responsible for driving the development process from conception to release. This role is an opportunity to start at the ground floor to develop the future of Sysco’s customer experience.",
        "requirement_text": "3+ years of experience developing on iOS\nStrong engineering skills and software fundamentals in developing on iOS\nSolid understanding of Swift and the iOS SDK\nA passion for iOS and a commitment to building award-winning apps for the platform\nKnowledge of networking at all layers of the protocol stack, and the iOS internals which power them\nA passion for building consumer facing applications with elegant and clean interfaces\nExperience developing, testing, shipping and supporting a product for hundreds of thousands of users is a plus\nA kind and generous attitude towards customers and coworkers alike.",
        "job_title": "iOS Developer"
    },
    {
        "description_text": "You will work with a cross-functional team, using your extensive knowledge of building apps in the Apple ecosystem to make the Affinity iOS apps the best they can possibly be.\nYou'll partner with Product and Design teams to craft exciting new features that will delight our users and help grow our communities around the globe.\nAlong the way, you’ll be learning about our business, our users, and what it takes to make apps that connect people and impacts their lives.",
        "requirement_text": "Experience developing and shipping apps on the iOS platform. Point us to your work in the App Store and show us what makes you proud!\nDeep understanding of Cocoa design patterns and API design\nExperience writing highly performant Swift code\nExperience with RxSwift or Reactive Programming\nSharp UI Skills and extensive understanding of animations & transitions using Core Animation and/or UIKit Dynamics\nExperience with Alamofire & Moya or similar frameworks\nExperience with Fastlane, Jenkins, or other continuous integration/deployment tools\nExcellent communication skills in both technical and non-technical discussions\nA constant desire to improve, learn more and take our team to the next level",
        "job_title": "Sr. iOS Developer (remote)"
    },
    {
        "description_text": "Work with fun, passionate coworkers of different backgrounds to create mobile apps used by millions of people worldwide.\nAssist project managers and other team members in devising technical solutions to business requirements.\nTake responsibility for translating functional requirements into a solid product, regarding both user experience and stability\nDeliver high-quality, well-architected code that’s clean and easy to understand and extend.\nBuild a great end-user experience in close collaboration with designers, coming up with solutions appropriate for the iOS platform and making the product shine with delightful animations and finishing touches.",
        "requirement_text": "You have a BSc degree in engineering preferably computer science and 5 years of native mobile development work experience.\nTroubleshooting and solving problems are second nature to you, and you know that finding a good solution often involves exploring all possible pitfalls.\nYou probably have been involved in multiple project creating high-quality iOS apps using the frameworks provided by Apple\nYou have participated in the development of sophisticated software solutions and have experience with complex business domains.\nYou are used to the challenges that modern computing platforms bring such as asynchronous programming, and are comfortable with the reactive programming paradigm.\nYou combine creativity and forward-thinking with a structured approach and can break down large features into manageable bits and pieces.\nAbove all you love programming, and creating wonderful user experiences makes you happy!",
        "job_title": "iOS Developer"
    },
    {
        "description_text": "Design and build applications for the iOS platformEnsure the performance, quality, and responsiveness of applicationsCollaborate with a team to define, design, and ship new featuresIdentify and correct bottlenecks and fix bugsHelp maintain code quality, organization, and automatization",
        "requirement_text": "Proficient with Swift\nExperience with iOS frameworks such as Core Data, Core Animation, etc.\nExperience with offline storage, threading, and performance tuning\nFamiliarity with RESTful APIs to connect iOS applications to back-end services\nKnowledge of other web technologies and UI/UX standards\nUnderstanding of Apple's design principles and interface guidelines\nExperience with performance and memory tuning with tools {{such as Instruments and Shark, depending on project needs}}\nFamiliarity with cloud message APIs and push notifications\nKnack for benchmarking and optimization\nProficient understanding of code versioning tools {{such as Git, Mercurial or SVN}}\nFamiliarity with continuous integration.",
        "job_title": "iOS Developer - C63020 5.2 New York, NY"
    },
    {
        "description_text": "To ensure success as an iOS Developer, you should demonstrate proficiency in one of the mainstream programming languages, and a sound understanding of the traditional product life cycle. An exceptional iOS Developer will be fearless but respectful in the pursuit of excellence, continually striving to shape the ways in which iOS apps impact the world around us.",
        "requirement_text": "Bachelors in Science in Computer Science, Software Engineering, Management Information Systems or equivalent degree\n2+ years of native mobile engineering experience working with iOS and/or related native mobile frameworks\nProficient in Objective-C, Swift, and Cocoa Touch.\nExtensive experience with iOS Frameworks such as Core Data and Core Animation.\nKnowledge of iOS back-end services.\nKnowledge of Apple's design principles and application interface guidelines.\nExperience in publishing an iOS app on the App Store\nExperience of mobile development life cycle\nWorking experience with JSON and data via REST\nWorking experience with APIs and third-party libraries\nExcellent coding and proofreading skills.\nTop-notch teamwork and communication skills.\nAbility to manage your workload with minimal supervision.\nLimited immigration sponsorship may be available",
        "job_title": "iOS Developer"
    },
    {
        "description_text": "Application development for native iOS platform.\nEnd to end ownership of the products you work on including but not limited to design, development, testing and delivery.\nStrong cross-functional contribution in defining and delivering the roadmap for products on various devices like mobiles and tablets.\nConforming to industry standards for application development and managing teams.\nContinuously discover, evaluate, and implement new technologies to maximize efficiency and performance.",
        "requirement_text": "Hands on development experience for iOS.\nKnowledge of professional software engineering practices & best practices for the full software development life cycle, including coding standards, code reviews and testing.\nStrong knowledge of algorithms, databases and programming concepts like OOP, multithreading, etc.\nExcellent verbal and written communication skills.\nKnowledge of version control systems like Git/SVN is a plus.\nKnowledge of web services is a plus.\nSelf-starter with ability to cope with sharp learning curves.",
        "job_title": "IOS DEVELOPER"
    },
    {
        "description_text": "Develop iOS Application",
        "requirement_text": "Minimum of 5-7 years experience in iOS and/or Android native Mobile development\nExperience in building hybrid & native based iOS apps using Objective-C and/or Android apps using Android Studio/Java\nExperience with client-side UI frameworks like Angular or React in a mobile context\nExperience with automated builds & processes, Fastlane, shell scripts, .xcconfig\nExperience with TestFlight, adding new users, adding release notes, managing versions and build numbers\nExperience building mobile apps using Cordova and Ionic (or other similar mobile development frameworks)\nExperience with app provisioning and all the associated processes – identifiers, profiles and certificates\nExperience in Linux/Unix/Mac OS X based environments, comfortable working with command line tools & scripting\nExperience with the following tools & technologies: Docker, Jenkins, Selenium, GIT, Swagger, SonarQube\nExperience with DevOps concepts, CI/CD, testing automation and TDD\nExperience working on teams that have employed agile and lean methodologies\nExperience with Bootstrap or similar frameworks\nExperience using CSS Preprocessors (preferably SASS)\nSkilled problem solvers with the desire and proven ability to create innovative solutions\nFlexible and adaptable attitude, disciplined to manage multiple responsibilities and adjust to varied environments.Passion for delivering quality software, and experience leading and mentoring senior developers in ensuring design and coding best practices and standards are followed",
        "job_title": "Mobile Developer (iOS)| OH"
    },
    {
        "description_text": "Collaborate with cross-functional teams to define, design, maintain, and ship new features in a dynamic work environment\nCreate internal tools to help streamlining the operations\nKeep up to date with the latest trends in iOS development",
        "requirement_text": "Must have shipped at least one app in the iOS app store\nExpert level proficiency in Xcode IDE, Swift, UIKit and tools such as Carthage and CLI\nAdvanced working knowledge of core web technologies, including APIs and protocols (e.g. HTTP, REST, JSON)\nStrong knowledge of MVC/MVVM and OOP principles\nFamiliar with Protocol Oriented Programming\nStrong optimization and debugging skills\nExcellent critical thinking, problem solving, and communication skills\nExperience implementing dynamic user interfaces\nHigh attention to detail with a focus on quality and customer experience\nFamiliar with version control systems such as Git\nGreat team player",
        "job_title": "Sr. iOS Developer"
    },
    {
        "description_text": "At sync. money we are looking for a ‘super-hero’ iOS Developer. An incredible new team player to join our family and help us to make a real difference. Someone to bring positive energy and a smile to the workplace. Whilst we may be building a company and a brand, we’re also building bonds that can last a lifetime.",
        "requirement_text": "English speaking, with multiple languages beneficial.\nHardworking, willing to take responsibility but also a co-worker.\nProactive, willing to get involved with the wider team and helping where possible.\nBeing passionate about your job and taking the initiative on coming up with new ideas how we can improve our product, culture and company. You are part of the community but a user too!\nWilling to learn but also to coach others where possible.\nUnderstanding about the importance of our product, the customer experience to peoples everyday lives and the need to support them where appropriate.",
        "job_title": "iOS Mobile Developer"
    },
    {
        "description_text": "Responsible for the technical design, coding, debugging, and support for complex iOS applications\nCollaborate with our product team members to design and implement new features\nPartner with engineers to build intuitive and mobile-optimized solutions\nDemonstrate strong software development fundamentals with an eye for design and architecture\nExplore and advocate for Software Engineer best practices\nAssist in debugging, and supporting a complex iOS application",
        "requirement_text": "Experience with Swift, iOS, iPadOS fundamentals and frameworks\nExperience with full stack software development, including building native iOS apps\nAbility to quickly learn new technologies independently\nExperience with iOS SDK frameworks such as CoreLocation, CoreData, Mapkit, PDFKit, and UIKit\nStrong communication skills, capable of owning end-to-end relationships with customers at all levels\nCollaborative teammate who can work effectively with other engineers across various teams and geographical locations\nProven track record delivering world class, iOS production grade software\nAbility to grasp Apple development tools\nBachelor’s degree and 3 years of relevant experience OR In absence of a degree, 7 years of relevant experience is required",
        "job_title": "MOBILE DEVELOPER (IOS)"
    },
    {
        "job_title": "iOS App Developer",
        "description_text": "As our iOS guru you will be responsible for spearheading WikiRealty mobile app. You will be a hands-on developer delivering quality app, on-time and on-budget. You will be working closely with Business, Product, Marketing and Support teams to hit key milestones. You will design and develop the app for iPhone and iPad with responsive touch, location and camera. You will ensure that all artifacts are managed in version control and proper tests are conducted routinely to ensure flawless delivery to AppStore and customers.",
        "requirement_text": "Expertise in C++, Objective-C. Exposure to Swift is a plus.\nDeep knowledge on MVC, UIKit, Cocoa, CoreData and SQLite.\nBackend integration with REST/JSON.\nWritten and published seriously cool apps on AppStore.\nTeam player - Lead by Example. Quick learner, problem solver and can-do attitude."
    },
    {
        "description_text": "NISC is looking for passionate iOS Mobile Developers to add to our team and push our native applications to their fullest potential. This application developer will work with our talented software engineers to design, build and evolve our mobile application suite. This position will work closely with our product, quality assurance and support staff to ensure quality and functionality requirements are met.",
        "requirement_text": "BS/MS in Computer Science, Computer Engineering or related.\nUnderstand the core aspects of iOS development (patterns, architecture, XCode environment)\nProficient with Swift and Objective-C.\n3+ years of experience.\nExperience with asynchronous workflows/patterns.\nExperience with Core Data.\nWorking knowledge of mobile trends, architecture and deployment patterns.\nExperience with Git including branching/merging workflows\nExperience with JIRA, Confluence, Bitbucket, Bamboo.\nKnowledge of Relational Databases (Oracle/SQLite).\nCommitment to NISC's Statement of Shared Values.",
        "job_title": "iOS Developer"
    },
    {
        "description_text": "Mobiquity is a thriving, growing group of strategists, creatives, and engineers. We are currently looking to add an iOS Developer to our team.\nWe are seeking a Senior iOS Developer with demonstrated experience designing and implementing enterprise scale mobile solutions. The ideal candidate will bring both strategic vision and solid execution skills to create native applications for mobile devices. This person should have the ability to start a new project from scratch, estimate effort and time to complete tasks, balance short term needs with long term goals, and managing tasks with appropriate priority and guidance. The ideal candidate should have wide knowledge and experience within iOS.",
        "requirement_text": "5+ years experience developing applications software\nExcellent working knowledge of Objective C and Swift\nDemonstrated expertise with Apple's iOS SDK (Cocoa, Cocoa Touch, etc.)\nExperience using RESTful APIs to integrate mobile applications to server side systems\nWorking knowledge of HTML5, CSS3, and Javascript a plus\nClear understanding of software development best practices\nExperience working in an agile environment\nWorking knowledge of SCM with strong emphasis on Git and proper Git Flow\nMust reference at least one application you developed that is available today",
        "job_title": "iOS Developer"
    },
    {
        "description_text": "Lead, design and build native applications for the iOS platform.\nCoach and mentor other mobile software engineers\nCollaborate with cross-functional teams to research, design and implement new features.\nResearch and design application infrastructure and patterns.\nResearch, analyze, and resolve complex customer issues and bugs.\nUnit test and integration test code as needed.\nFollow all established software development methodologies and procedures.",
        "requirement_text": "6+ years industry experience\nStrong understanding of data structures and algorithms\nStrong knowledge and understanding of OO concepts\nThrives working in a collaborative team environment\nBS/MS in Computer Science, Computer Engineering or related.",
        "job_title": "Sr. iOS Developer"
    }
]